{"hot_articles":[{"id":12,"title":"Rohit Sharma slams third hundred of the series","extended_text":"Not so before Rohit Sharma got the opportunity to open the innings in the longest format of the game and the decision which came bit late for his fans, he is showing all, he is equally capable to play long innings in test matches.\nIts his 3rd hundred in 4 innings he has played so far in the series. The play was interrupted due to bad light, India recovering from early blows at 224/3.\nAjinkya Rahane is also looking good for hundred and good chance for Rohit Sharma to make this hundred a daddy hundred or a double century. India will be looking to play while day tomorrow and test South African openers for the last 10 overs.Stay tuned.","truncated_text":"Not so before Rohit Sharma got the opportunity to open the innings in the longest format of the game and the decision which came bit late for his fans, he is showing all, he is equally capable to play long innings in test matches.","is_published":true,"created_on":"2019-10-19T00:00:00Z","image":"rohit-sharma_19-10-19.jpeg","slug":"rohit-sharma-slams-third-hundred-of-the-series","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":1},{"id":15,"title":"India wrap up the series 3-0,Rohit Sharma Man of the series","extended_text":"India cleansweeped Proteas as the fortunes not turning for the South Africa.After a poor world cup performance clean sweep of test series by India certainly not a good sign to where their team is going.They need to rethink,reevaluate and come out with new players, who can sustain the pressure and stop this downfall of their team atleast for their fans all around the world.\n\nNadeem wrapping up the remaining two wickets in no time. Rohit Sharma as expected won the Man of the series award saying he follows a certain template to his batting that has given him some success.\n\n3 hundred in 4 innings for him and 1 big double hundred for Virat Kohli.Mayank Agarwal also got a double hundred and Ajinkya Rahane also got hundred on home soil after 2016.Much needed for him.\n\nBowlers have been good.Shami classical in second innings,Ashwin in the first two test matches and Jadeja certainly has up his game in batting department which is giving the team India liability to play with 5 proper bowlers.\n\nNothing much to talk about from South Africa as they have been in complete disarray in all departments.Dean Algar started the series on high but lost his way through in the last two matches and the spin bowling has been very poor for them.\n\nLion in his den was spotted as Mahendra Singh Dhoni came to the dressing room and had a chit chat with his teammates.No news on his availability for the coming Bangladesh series though.\n\nIndia certainly will like to carry this good form and with no big tournament win for team India in the recent years ,the focus will be on world cup T20.\n\nStay tuned for further updates","truncated_text":"India cleansweeped Proteas as the fortunes not turning for the South Africa.After a poor world cup performance clean sweep of test series by India certainly not a good sign to where their team is going.They need to rethink,reevaluate and come out with new players, who can sustain the pressure and stop this downfall of their team atleast for their fans all around the world.","is_published":true,"created_on":"2019-10-22T00:00:00Z","image":"india-win_22-10-19.jpg","slug":"india-wrap-up-the-series-3-0-rohit-sharma-man-of-the-series","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":2},{"id":29,"title":"What's going on Dhoni's mind?","extended_text":"Mahendra Singh Dhoni is not seen on the cricketing field after world cup.The World Cup winning captain for team India has taken time off from the cricket field to spend some time with military forces and then further was not available for selection against Bangladesh series.There have been speculations and all sorts of talk going around on what he is really upto.Has he retired in his mind and is just to make formal announcement any time or he is thinking something else.What really is going on Dhoni's mind?\n\nDhoni has not played any cricket from few months but he has not retired too.So he is not done yet as far as international career is concerned.He is thinking to play selective cricket from here.He is eyeing the big tournaments.He is still fit at 38 and with two  world T20 cup one after the other, he will certainly make himself available for the selection.\n\nEverybody knows the impact he makes when he is on the field.He showed world once again that he is made of nerves of steel in world cup semifinal.And if not for a slight hesitation in coming back for that second run, he would have taken India home.\n\nNo surprises even if he will make himself available for next ODI world cup.He knows he will not be an automatic selection in the playing 11,but he will  not be affected by this.What he will do with this approach of him is to give team management the cushion to play him as a batsman or wicket keeper batsman in crucial games. Time is running out for Rishabh Pant and Sanju Samson will be given chances to show what he is capable of but Dhoni has nothing to do with things going around him.He is thinking like a player who works hard and his only dream is to represent India at the international level.\n\nHe knows he  can't play all series but he is there for big tournaments.Whether the team thinks he can make a difference in the playing 11 or not is another thing but he will make himself available for big tournaments.A good approach from him .Not like some great players retiring just after one  bad series. He came as a player and he will go as a player.\n\nStay tuned.","truncated_text":"Mahendra Singh Dhoni is not seen on the cricketing field after world cup.The World Cup winning captain for team India has taken time off from the cricket field to spend some time with military forces and then further was not available for selection against Bangladesh series.There have been speculations and all sorts of talk going around on what he is really upto.Has he retired in his mind and is just to make formal announcement any time or he is thinking something else.What really is going on Dhoni's mind?","is_published":true,"created_on":"2019-11-14T00:00:00Z","image":"MS-Dhoni-14-11-19.jpeg","slug":"whats-going-on-dhonis-mind","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":3},{"id":13,"title":"Rohit double hundred,India in charge","extended_text":"Rohit Sharma slammed first double century of his test career as South African bowlers led frustrated by the counter attack of Rohit Sharma and Ajinkya Rahane.Rahane also played magnificently scoring a hundred.\n\nIndia declared on mammoth total of 497 runs and also managed to pick 2 South African wickets as the visitor scorecard reads 9 at the loss of 2 wickets.\nSouth Africa really need to show his A game from here if they want to avoid a clean sweep of the series while Virat Kohli knows it's their best chance to clean sweep the series at home.\n\nExpecting a fight from South African batsman and looking forward to how the local boy Shadab Nadeem will bowl.\nStay tuned.","truncated_text":"Rohit Sharma slammed first double century of his test career as South African bowlers led frustrated by the counter attack of Rohit Sharma and Ajinkya Rahane.Rahane also played magnificently scoring a hundred.","is_published":true,"created_on":"2019-10-20T00:00:00Z","image":"india_rohit_20-10-19.jpg","slug":"rohit-double-hundred-india-in-charge","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":1},{"id":17,"title":"We are moving on from MS Dhoni: MSK Prasad","extended_text":"Team for T20 and tests against Bangladesh on home soil  have been announced .Virat Kohli has been rested for T20s and Rohit Sharma will lead the team India .Sanju Samson and Shivam Dube have been given maiden call ups  after their brilliant show in Vijay Hajare trophy. With Sanju Samson coming into the team and Rishabh Pant not living upto the hype ,a great opportunity for the Kerala boy to present his case for the wicketkeeper batsman for India.\n\nMSK Prasad has told clearly that they are now looking ahead of Dhoni ,and Dhoni and selectors are on the same page with this. Though there was no clarity about whether Dhoni himself made unavailable for the T20 or selectors overlooked him .Looks like Dhoni will make himself available for the world cup T20 and he wants to play selective cricket from here.No surprises even if he makes himself available for world cup 2023. Seems like, Dhoni is thinking like a young batsman and still thinks he has cricket left in him which will help India in big tournaments,and we have no doubts about Dhoni match winning capabilities.","truncated_text":"Team for T20 and tests against Bangladesh on home soil  have been announced .Virat Kohli has been rested for T20s and Rohit Sharma will lead the team India .Sanju Samson and Shivam Dube have been given maiden call ups  after their brilliant show in Vijay Hajare trophy. With Sanju Samson coming into the team and Rishabh Pant not living upto the hype ,a great opportunity for the Kerala boy to present his case for the wicketkeeper batsman for India.","is_published":true,"created_on":"2019-10-25T00:00:00Z","image":"Samson_25-10-19.jpg","slug":"we-are-moving-on-from-ms-dhoni-msk-prasad","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":1},{"id":18,"title":"Warner 100 in 1st T20 against Sri Lanka","extended_text":"Some relief for David Warner as he scored blizzering century of 56 balls which included 4 sixes to help Australia put a mammoth total of 232 in 20 overs.In reply Sri Lanka was completely undone by Australian bowlers as they managed to score a mere 99 runs in 20 overs for the loss of 9 wickets.\n\nWarner who had dearth of runs in Ashes, had a lot to prove his place in the playing 11 and this hundred will certainly up his confidence to put his career back in place.\nMaxwell gave him good support from other hand with  62 runs in just 28 balls.\n\nSri Lanka will want to leave this loss behind and will look to put Australia under pressure in rest of the series.They will certainly want to continue from the clean sweep of 3-0 against Pakistan but this new face Sri Lankan team need to show consistency to match the level of brand of cricket Sri Lanka used to play before.\nStay tuned.","truncated_text":"Some relief for David Warner as he scored blizzering century of 56 balls which included 4 sixes to help Australia put a mammoth total of 232 in 20 overs.In reply Sri Lanka was completely undone by Australian bowlers as they managed to score a mere 99 runs in 20 overs for the loss of 9 wickets.","is_published":true,"created_on":"2019-10-28T00:00:00Z","image":"warner_28-10-19.jpg","slug":"warner-100-in-1st-t20-against-sri-lanka","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":1},{"id":40,"title":"Mitchell Santner, Jimmy Neesham, Colin de Grandhome - The perfect trio","extended_text":"Mitchell Santner has been a key player for New Zealand for quite some time. This left arm tall kiwi player has got good action in him, which helps him to keep things tight for his team. His bowling stats are certainly impressive, especially his economy. He is a strong lad with good height and his action allows him to bowl at desired lengths.\n\nHe recently took 3 wickets in 4th innings against England and scored a century for his team, his partnership with B J Watling who scored a double century is now the highest 7th wicket partnership for New Zealand in tests. He has played some useful cameos for his team down the order. He also hit 6 in an IPL match for CSK to finish things off.\n\nIn the world cup, his performance was great. He was exceptional in the rain-affected semifinal which took 2 days to complete. He took the wicket of Rishabh Pant and Hardik Pandya when India was looking to build their innings. In other matches too, he bowled well.\n\nHe along with Jimmy Neesham, Colin de Grandhome gives New Zealand a lot of options in the bowling department. All 3 of them bowls regularly for their team. Who can forget Jimmy Neesham who almost won the super over for New Zealand in World cup final.\n\nColin de Grandhome also played some good innings in the world cup, especially his wonderful counter knock against South Africa which helped the Kiwi captain Kane Williamson to take some time in the middle as Grandhome made sure  New Zealand was not way behind in asking run rate. He also bowled superbly in World cup final and took some important wickets including the wicket of Joe root.\n\nGrandhome started playing cricket for Zimbabwe and he had to work hard to be part of playing 11 for New Zealand. He builds his reputation in Zimbabwe but leaving Zimbabwe and start things from scratch again here in New Zealand, he got a bigger challenge in front of him to make an impression. He now is a regular feature for New Zealand among all formats. He can bat with a good strike rate and hit those humungous sixes at times to help his team with the run rate.\n\nNew Zealand is lucky to have three power-packed allrounders in their team who are only getting better with time. They can bowl for their team and they can hit those cherries over the boundary too. Not to forget each one of them is an exceptional fielder.\n\nThe trio has provided New Zealand the flexibility to change its batting and bowling order according to game conditions. From the last one year, it will be difficult to find a game when none of them clicked for their team, such is the value of these players, other teams can only dream to have such three allrounders in their team.\n\nStay tuned.","truncated_text":"Mitchell Santner has been a key player for New Zealand for quite some time. This left arm tall kiwi player has got good action in him, which helps him to keep things tight for his team. His bowling stats are certainly impressive, especially his economy. He is a strong lad with good height and his action allows him to bowl at desired lengths.","is_published":true,"created_on":"2019-11-27T00:00:00Z","image":"santer-27-11-19.jpg","slug":"mitchell-santner-jimmy-neesham-colin-de-grandhome-the-perfect-trio","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":4},{"id":24,"title":"Can ODI greats become T20 greats too?","extended_text":"There are 3 formats followed in cricket.Test cricket is played with red cherry and 50 overs and 20 overs follows white ball.There are number of batsmen who have played superb innings in one format but when we talk about the transition from one format to another,there are very few players who are successful in all 3 formats.\n\nGoing back into time,Rahul Dravid was a champion test player and one of the all time best players in the test cricket but he certainly didn't have the same success in ODI cricket. By no means he was bad or average in ODI,but if we compare his test cricket with ODI cricket he himself would have wanted more impactful innings in the 50 over format.\n\nThen there were players who were considered as best in one format and they hardly played a significant amount of matches in ODI format back then.Justin Langer is one such player who had tons of runs under his belt in red ball cricket but his ODI career is not worth mentioning.With time, those players focused on one format only and tried to become one format genius.\n\nFew players  transitioned from ODI format to test cricket too and the transition  went well for them.Virendra Sehwag is one such player who revolutionized test cricket by playing with the same aggressive mindset like in ODI cricket.\n\nThe close fielders and enough gaps in the field in test cricket helped him getting value for his shots and he became so good in test cricket that by the time he retired he had a test average of 45 with strike rate of above 80, making him one of the best test batsman India have ever produced.He finished ODI with average of 35,slightly below average considering his test match performance.In the end Sehwag can be considered as champion test batsman but an average ODI player although he started playing ODI cricket before.\n\nRohit Sharma is yet another batsman who is following the footsteps of Sehwag having won Man of the series in the recently concluded test series against South Africa, but the difference is Rohit Sharma is already champion limited format batsman, be it ODI cricket or T20 cricket, and he looks very determined this time to carry on his great stats of ODI cricket into test cricket too.\n\nComing to bowlers and on the contrary we have Shane Warne who is all time great test bowler but in limited overs format he has lesser number of wickets than Sri Lankan legend Sanath Jaysuriya. Not just wickets his economy was also on the higher side. The transition from test cricket to ODI cricket for Shane Warne did not conclude as he wanted.\n\nIndia also had one unsung hero in test cricket who didn't get chance to represent in ODI cricket.Any guesses? We are talking about Wasim Jaffer who used to hit daddy hundreds every time he passes the 100 run mark and was a little unfortunate to not play for a longer period of time.\n\nThen comes T20 cricket and we are now seeing pool of players wanting themselves to be tagged as T20 specialist.These are the players who promises to hit few into the stands when needed, and can bowl a few overs too along with livewire in the field. Chris Gayle is one such player if we eliminate the fielding capabilities.He can bowl too.Actually Chris Gayle has got a good action which uses his height well and he is under bowled, teams focus on his batting capabilities only.\n\nShahid Afridi from Pakistan is also among the best players of T20 cricket.He has good record in 50 overs too, thanks to his economic bowling in the later part of his career.But he certainly will not want anyone talking about his test career.\n\nSo,what exactly is needed to allow players to have smooth transformation from one format to another. One player, we actually have two of them with other needs a little  more effort in T20 cricket.The two greats of the modern era -  Virat Kohli and Steven Smith.Virat Kohli has been exceptional in all 3 formats.Though he didn't have a century to his name in T20 format, he gave  some match winning innings for team India.The best of him came against Australia in world T20 semi final when India needed something around 40 in 3 overs.\n\nThe reason he has been so successful across all formats is his technique and the way with which he builds the innings doesn't change.As he already said he looks to hang around there for first 20-30 balls and then take it from there.We can rate Steven Smith slightly higher than Virat Kohli in test cricket but just marginally, and the two are always in a race to who stands at 1st position in ICC rankings.T20 cricket is the area he will want to improve but he has given good performance against Pakistan in the ongoing T20 series and that's the quality of greats, they adapt faster. They make mistakes, but they learn quickly and become a better version of themselves.\n\nThe question is,should player focus on one format or they should look to excel in all formats.The key takeaway is to first get hold of ODI cricket. If you are doing good in ODI cricket, you can make certain changes in your games that will give you success in test cricket and T20 cricket too.The ODI format balances the aggression needed to keep the scoreboard ticking and stay there in the crease for a longer period of time.\n\nYes we forgot to talk about Joe Root but let's wait till he gave some top notch performances.\n\nStay tuned.","truncated_text":"There are 3 formats followed in cricket.Test cricket is played with red cherry and 50 overs and 20 overs follows white ball.There are number of batsmen who have played superb innings in one format but when we talk about the transition from one format to another,there are very few players who are successful in all 3 formats.","is_published":true,"created_on":"2019-11-07T00:00:00Z","image":"smith-07-11-19.jpg","slug":"can-odi-greats-become-t20-greats-too","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":9},{"id":20,"title":"India Bangladesh to play day-night test in Kolkata, Shakib suspended","extended_text":"India and Bangladesh are set to play day-night test match in Kolkata.Started as a desperate measure to increase the popularity of test match among fans,teams are looking forward to welcome this change.From last year,cricket has seen a gradual decline in its popularity and test matches are vastly affected.Time has come ICC should come up with new and interesting measures to stop cricket dying a slow death.\n\nIn other news,Bangladesh World Cup hero Shakib Al-Hasan has been suspended for two years from international cricket with immediate effect for not reporting approach of a bookie.ICC has no tolerance policy towards fixing and if players will not cooperate with ICC by reporting any such activity,it will be an uphill task for ICC to make it fixing free.This ban is huge setback to Bangladesh world cup T20 preparations and the management will be looking for a like to like replacement for him,easily said than done.\n\nStay tuned.","truncated_text":"India and Bangladesh are set to play day-night test match in Kolkata.Started as a desperate measure to increase the popularity of test match among fans,teams are looking forward to welcome this change.From last year,cricket has seen a gradual decline in its popularity and test matches are vastly affected.Time has come ICC should come up with new and interesting measures to stop cricket dying a slow death.","is_published":true,"created_on":"2019-10-30T00:00:00Z","image":"Shakab_30-10-19.jpg","slug":"india-bangladesh-to-play-day-night-test-in-kolkata-shakib-suspended","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":1},{"id":21,"title":"Rahul Chahar vs Yajuvendra Chahal vs Kuldeep Yadav,who India should play in world T20?","extended_text":"World cup T20 is less than a year away.While it is majorly regarded as batsman game ,bowlers too get their day in low scoring games and any captain loves to have wrist spinners in their team ,as they pick up wickets at crucial times.After the defeat in world cup semifinal ,Yajuvendra Chahal and Kuldeep Yadav were not selected for T20 cricket citing the reason to have long batting line up,hence the focus shifted on the players who can hold on with the bat for some time in the middle.\n\nIndian team gave chance to Rahul Chahar for his impressive performance in IPL 2019,but he has got very few chances and in those very few chances he has got,he was not impressive at all going for runs.\nHe has good action ,straight run up,an orthodox action but he can turn the ball .At times it looks like he can be hit very easily by lining him up but he can pick up wickets too with same deliveries. He needs to find a balance between tight line and those flighted deliveries which can deceive batsman into playing a big shot.\n\nYajuvendra Chahal has been the backbone of Indian bowling line up for quite some time in the limited overs format.He has performed reasonably well in 50 overs and 20 overs cricket. Though he could have performed better against New Zealand in world cup semifinal where he was the alone wrist spinner for team India ,he went for 63 runs in 10 overs .He started the campaign on high by picking 4 wickets against South Africa but Indian team and Indian fans certainly wanted him to step up in the biggest tournament of cricket.While we can’t say he failed,his performance in the later part of the tournament was slightly below average but just slightly. Adds to this,his inability with the bat ,Indian management thought of trying bowlers who can bat a little ,the experiment which has failed miserably and Chahal has been recalled for the home T20 series against Bangladesh.This is good chance for him to prove his worth again and he certainly did nothing wrong which can keep him out of the team but he himself will certainly want to step up his game and help India winning more matches in big tournaments.\n\nNext,we have Kuldeep Yadav.India have played both Yajuvendra Chahal and Kuldeep Yadav in limited overs format for quite some time, but the world cup performance of Kuldeep Yadav has been below par.He was not able to pick up wickets ,also he didn't bowl tight lines and he was expensive in the world cup.Though the road to return is not completely closed for him,to make comeback in T20 international is an uphill task for him.On any given day ,Yajuvendra Chahal is a better bowler than him and he needs to come up with Kuldeep 2.0 if he fancies any chances of playing limited overs cricket again after his shoulder injury.\n\nThen we have Shreyas Gopal who resembles Kumble in bowling action .He can bat but the selectors at this time is not looking at him.The call for him in T20 cricket is certainly just around the corner and can come up at any time.Though he doesn't have the surprise element or a great action but he needs to be given some chances too.\n\nOther than these players, India doesn't seem to have backup options in spin bowling department.Rahul Chahar will be given games to prove his metal ,but he will see tough competition from Yuji Chahal.\n\nWho India will play for world T20 is how these players will perform in the coming series but as for now ,the wrist spinner position is for to take.\n\nStay tuned.","truncated_text":"World cup T20 is less than a year away.While it is majorly regarded as batsman game ,bowlers too get their day in low scoring games and any captain loves to have wrist spinners in their team ,as they pick up wickets at crucial times.After the defeat in world cup semifinal ,Yajuvendra Chahal and Kuldeep Yadav were not selected for T20 cricket citing the reason to have long batting line up,hence the focus shifted on the players who can hold on with the bat for some time in the middle.","is_published":true,"created_on":"2019-10-31T00:00:00Z","image":"Kuldeep-Yadav-Yuzvendra_31-10-19.jpg","slug":"rahul-chahar-vs-yajuvendra-chahal-vs-kuldeep-yadav-who-india-should-play-in-world-t20","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":6},{"id":52,"title":"Another win for the Indian team, poor cricket from New Zealand","extended_text":"India on their New Zealand tour registered their second consecutive win in the ongoing T20 series.\n\nThe match was played on the same ground, beautiful Eden Park with short boundaries but New Zealand batting first was all sort in woes as their batsman just couldn't get going.\n\nMartin Guptill played some good shots in the starting but Colin Munro didn't get any sort of timing in his shots.\n\nShivam Dube got the wicket in his first ball and he also created pressure on Munro who was caught at the cover trying to break the shackles.\n\nIn the end, New Zealand just managed 132 runs and though the wicket was a little on the slower side from the first match, 132 was far away from a competitive total.\n\nRohit Sharma didn't pass the double-digit mark again and Kohli was unlucky to be dismissed playing a leg glance.\n\nIndian team new sensation in form KL Rahul and Shreyas Iyer played sensibly and made sure India stays ahead with 2-0 lead in the series.\n\nPoor from New Zealand as their batsman played some defensive cricket after a couple of quick wickets, the mindset which doesn't win you matches in T20 cricket.\n\nThe Black Caps will need to reinvent their strategy for third T20 as the series is now on stake.\n\nTheir batsman need to play fearless cricket and bowlers also will have to keep things tight against the never-ending batting line up of the Indian team, thanks to K L Rahul doing good work behind the wickets.\n\nIts gonna be a cracker of a test, the third T20 and Black Caps need to rewatch the World Cup semifinal to draw the inspiration to challenge this Indian team.\n\nTill then, stay tuned.","truncated_text":"India on their New Zealand tour registered their second consecutive win in the ongoing T20 series.The match was played on the same ground, beautiful Eden Park with short boundaries but New Zealand batting first was all sort in woes as their batsman just couldn't get going","is_published":true,"created_on":"2020-01-26T00:00:00Z","image":"indvsnz_26-01-2020.jpg","slug":"another-win-for-the-indian-team-poor-cricket-from-new-zealand","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":2},{"id":22,"title":"Delhi ,Diwali and Cricket ","extended_text":"The first T20 between India and Bangladesh is set to happen as planned on 3rd November.While there's nothing special about this ,but what has drawn attention of all fans and cricket pundits,is the venue.The play is to happen at Arun Jaitley cricket stadium formerly known as Feroz Shah Kotla stadium.\n\nWell there is nothing to worry about if cricket is to play in Delhi, but the real point of concern is ,we are less than a week away from Diwali and as happened in the last few years ,a thick layer of smog has engulfed Delhi and the air quality index is not looking good at all.Despite all this,BCCI has decided to not change the venue and the inaugural match of the t20 series will be played at Arun Jaitley Cricket stadium,takes some time to adjust to the change in name.\n\nIndian players have been seen practicing without any mask ,while Bangladeshi players were not hesitant putting it on.Rohit Sharma faced an injury scare ahead of the match ,but as confirmed is fit to play and lead team India in absence of Virat Kohli who has been rested.\n\nLot of celebrities and social media  influencers not welcoming BCCI decision to play as scheduled in Delhi overlooking the air quality.While the venue could have been shifted,Delhi people might want to give a thought to why it is needed in the first place.\n\nInstead of bursting crackers from a week before a week later ,people should find ways to celebrate Diwali in a clean way.Chhath puja is another hindu festival celebrated after Diwali ,and is considered as the most eco friendly hindu festival by environmentalists.\n\nSmog or not,the stadium will not see a vacant seat as the people will not want to miss their favorite players playing cracking shots after they have done their part in all colors.","truncated_text":"The first T20 between India and Bangladesh is set to happen as planned on 3rd November.While there's nothing special about this ,but what has drawn attention of all fans and cricket pundits,is the venue.The play is to happen at Arun Jaitley cricket stadium formerly known as Feroz Shah Kotla stadium.","is_published":true,"created_on":"2019-11-02T00:00:00Z","image":"Delhi-smog_2-11-19.jpg","slug":"delhi-diwali-and-cricket","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":3},{"id":16,"title":"T20s and need of change in approach for Team India","extended_text":"The one format every cricketing nation wants to focus on now is the T20 format.Started not long before,the T20 format is the most watched format among cricketing fans.But looks like Indian team is not fully aware of the fact that all you got are 120 balls only. Team India have been playing T20 format like one day cricket by playing too defensive cricket and with World Cup 2020 around the corner ,it certainly calls for change of approach for Indian team.\n\nThe other team which has done quite well in this shortest format is England and one of the reasons is their long batting lineup and no hesitation or second thoughts in going bang bang from the very first ball.Even if some early wicket falls,they don't change their batting approach and plays attacking cricket while Indian team looks to pass few overs, taking over his mentality from the 50 over format.\n\nAnother example is the most successful team in T20 format having won the World Cup twice, is West Indies.They also goes hard to the bowlers from the starting of the innings.The next batsman in the crease knows nothing about what the wicket column reads, and he still looks to play attacking cricket.While some will disagree that there are some low scoring total in T20 too but with this attacking approach ,the chances of having a collapse is not substantial.\n\nYou just can't pass the ball back to the bowler. You will have to find some ways to keep the scoreboard ticking,this is not your 50 over format. 120 balls and 10 wickets is enough to not fool around hanging in there for nothing.\n\nIndian team seriously needs to address this issue if they fancy their chances of winning T20 World Cup.Indian team has done well in recent times but if we talk of major tournament wins the counter reads zero and this is what all matters.\n\nIndian team will be playing a lot of T20s to rehearse for the coming world cup and they should start playing with this new approach. Failing to do so ,a loss at a big tournament is waiting and fans are just not ready for it after the poor show of batting in world cup semifinal.","truncated_text":"The one format every cricketing nation wants to focus on now is the T20 format.Started not long before,the T20 format is the most watched format among cricketing fans.But looks like Indian team is not fully aware of the fact that all you got are 120 balls only. Team India have been playing T20 format like one day cricket by playing too defensive cricket and with World Cup 2020 around the corner ,it certainly calls for change of approach for Indian team.","is_published":true,"created_on":"2019-10-24T00:00:00Z","image":"T20-24-10-19.jpg","slug":"t20s-and-need-of-change-in-approach-for-team-india","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":3},{"id":27,"title":"West Indies won the 3rd ODI against Afghanistan to clean sweep the series 3-0","extended_text":"Batting first Afghanistan scored 249/9. Asghar Afghan carried his good from world cup and scored an impressive 86. Nabi and Zazai also gave vital contribution to their team each scoring 50 runs.\n\nWest Indies team had horrible start.Lewis and Hetmyter were dismissed cheaply.But Shai Hope stayed there to keep the scoreboard ticking.The wicketkeeper batsman didn't have a great run at the World Cup 2019, but he is starting afresh and looking to score runs.Pollard,Brandon and Rostan Chase also scored important runs for their team to take West Indies home.\n\nIndia also won the 3rd T20 against Bangladesh to seal off the series.Batting first India lost both their openers cheaply but K L Rahul and Shreyas Iyer who was dropped very early in the innings made sure India got to a competitive total.Shreyas Iyer has been batting well for India showcasing he is the right player at no 4 for India.\n\nIn reply, the impressive youngster who made debut in the first match of the series, Naim played superbly and played beautiful innings of 81 runs.He is creating pressure on Tamim Iqbal who had a disastrous world cup and is out of form from quite some time.Till 15th over, Bangladesh was very much in the hunt, but continuous fall of wickets and no one to accompany Naim in the middle made chase difficult for them.Shivam Dube provided India with crucial breakthrough of Naim and at the end of innings Deepak Chahar finished with a hatrick and best figure in T20 so far taking 6 wickets, giving away just 7 runs.\n\nKrunal Pandya and Washington Sunder were unimpressive in all 3 matches, not making any impact with their bowling. Another bad tournament for Rishabh Pant who made some basic mistakes in wicket keeping and didn't score much runs.Pressure on him now as Sanju Samson in the dugout is waiting.Though he didn't get the chance in this tournament, he knows he will get his chances to prove his metal.\n\nStay tuned.","truncated_text":"Batting first Afghanistan scored 249/9. Asghar Afghan carried his good from world cup and scored an impressive 86. Nabi and Zazai also gave vital contribution to their team each scoring 50 runs.","is_published":true,"created_on":"2019-11-12T00:00:00Z","image":"wi-vs-afg-12-11-19.jpg","slug":"west-indies-won-the-3rd-odi-against-afghanistan-to-clean-sweep-the-series-3-0","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":3},{"id":25,"title":"Indian women gets a big win,raining sixes in 4th T20 between England and New Zealand","extended_text":"Indian women cricket team defeated west indies team by a huge margin of 84 runs.Batting first Indian team put 185 runs in 20 overs.Smriti Mandhana and 15 year old Shafali Verma playing her 5th T20 were among the runs for India.\n\nSmriti Mandhana scored 67 runs off just 46 balls but the top scorer for the team was Shafali Verma who scored 73 runs and also hit 4 sixes.\n\nIn reply West Indies team didn't look like they had a plan to the chase with wicket falling at regular intervals succumbing to just 184 runs.\n\nIn other news,the 4th T20 between England and New Zealand came out with big hitting display for Dawid Malan who scored century and was supported by Eoin Morgan who scored 91 with 7 sixes.New Zealand were off the track in the chase from the beginning.Top scorer for them was their stand in captain Tim Southee who is captaining the team in absence of Kane Willaimson who had some difficulty scoring runs after a great world cup and was out of this series because of injury .\n\nIndia leveled the 3 match T20 series against Bangladesh.Rohit Sharma scored blizzering 85 runs off 43 balls and missed out on his 4th century of T20.All set for the final T20 today.Both team will be looking to play their best game and seal the series.\n\nStay tuned.","truncated_text":"Indian women cricket team defeated west indies team by a huge margin of 84 runs.Batting first Indian team put 185 runs in 20 overs.Smriti Mandhana and 15 year old Shafali Verma playing her 5th T20 were among the runs for India.","is_published":true,"created_on":"2019-11-10T00:00:00Z","image":"dawid-shefali_10-11-19.jpg","slug":"indian-women-gets-a-big-win-raining-sixes-in-4th-t20-between-england-and-new-zealand","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":2},{"id":2,"title":"Indian team announcement for the West Indies tour","extended_text":"Finally the Indian team has been announced for the West Indies tour.\n\nNo Dhoni as expected as he had himself asked for 2 months of no-cricket time.Pant has been included in all formats .Saha has also been included in long overs format as MSK Prasad told reporters about a unwritten rule that selectors will give chance to senior players once they are fit while they were out before because of the injury,but in ODI and T20 format Rishabh Pant will be part of playing 11 in all the matches.\n\nChahal and Kuldeep are rested for T20 format and Rahul Chahar has been given the maiden call on the basis of his tremendous IPL performances.Navdeep Saini is the other newcomer to the Indian side as he will be joining team India for ODI and T20 format along with second chance to Khaleel Ahmed.\n\nShikhar Dhawan is back from injury and surprisingly, no place for Mayank Agarwal who was called as a backup opener in world cup.\n\nVirat Kohli will still lead the side with Rohit Sharma and Ajinkya Rahane as vice captain in 50 over and test cricket.\n\nManish Pandey and Shreyas Iyer has also been included in shorter formats of the game.\n\nReporters did ask MSK Prasad about Ambati Rayadu handling, to which MSK replied that team wanted a left hander in middle order after the only left hander Shikhar Dhawan was injured and after K L Rahul was looking doubtful when he jumped across the fence against England,the team wanted a backup opener which explains the inclusion of Mayank Agarwal for the later part of tournament.\n\nThe reporters seemed satisified with MSK Prasads answer","truncated_text":"Finally the Indian team has been announced for the West Indies tour.\n\nNo Dhoni as expected as he had himself asked for 2 months of no-cricket time.Pant has been included in all formats ","is_published":true,"created_on":"2019-07-23T00:00:00Z","image":"India_squad_23-07-19.jpg","slug":"indian-team-announcement-for-the-west-indies-tour","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"dummy_tag","tag_key":"","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":2},{"id":33,"title":"Australia is all over Pakistan in the first test against Pakistan on day 2.Batting first on day 1, Pakistan scored 240 runs","extended_text":"The top scorer for the Pakistan team was Asad Shafiq who played with a good strike rate scoring 76 runs. Azahar Ali and Rizwan also helped Pakistan to cross the 200 run mark.\n\nMitchell Starc got 4 scalps to his name, while Cummins was able to send 3 batsmen to the pavilion. Josh Hazelwood also joined the party picking up a couple of wickets.\n\nThe batsman carried the good form from bowlers on day 2 for Aussies. The Kangaroos were right on the track from ball 1. Warner and Burns took every Pakistan bowlers on their charge and scored at a good pace.\n\nAt the end of the second-day play, Australia scorecard reads 312 for the loss of lone wicket of Burns, who was unlucky to miss out on well-deserving century at 97.\n\nWarner is still at the crease on 151 runs. After a horrible Ashes, he was in desperate need of some runs in test cricket, and he certainly will want to convert this century into a double hundred or even more, considering Aussies are batting with a  good run rate so far.\n\nMarcus Labuschagne, who had good ashes,  is at the crease with him and he remained unbeaten on 54 runs.\n\nPakistan certainly will have to do something special from here if they want to turn things into their favor, as the test match is slipping from their hands.\n\nA lot of test cricket is happening around the world at this time. India is set to play Bangladesh for their first pink ball test. The city of joy Kolkata is living the pink spirit as the various famous monuments and bridges were lighted with pink color to celebrate the first-ever day-night test cricket for India.\n\nIn shocking news, Sanju Samson is not selected for the T20s against West Indies.The Kerala boy was selected for the home series against Westindies but didn't get a chance to feature in the playing 11, and now he is out of the team which is simply difficult to comprehend for all his fans over the country. Rishabh Pant will be doing the gloves for India as he is the lone specialist wicketkeeper in the squad as Dhoni remains unavailable.\n\nShivam Dube has got the maiden call up in ODIs. Frequent injuries for Hardik Pandya have made management look for a like to like replacement for him who can bat at good strike rate and also roll up his sleeves to bowl a few overs for the team. Krunal Pandya is not selected as Ravindra Jadeja found his place back in the T20s. A lot of experimentation in team selection is going on but fans will not mind it as long as India keeps winning matches.\n\nStay tuned.","truncated_text":"The top scorer for the Pakistan team was Asad Shafiq who played with a good strike rate scoring 76 runs. Azahar Ali and Rizwan also helped Pakistan to cross the 200 run mark.","is_published":true,"created_on":"2019-11-22T00:00:00Z","image":"Australia-22-11-19.jpg","slug":"australia-is-all-over-pakistan-in-the-first-test-against-pakistan-on-day-2-batting-first-on-day-1-pakistan-scored-240-runs","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":4},{"id":32,"title":"What's ahead for Kuldeep Yadav?","extended_text":"Not long before, Kuldeep Yadav was a regular feature in the Indian cricket team for ODIs and T20s. The wrist-spinner along with Yajuvendra Chahal was having a dream run in the field, choking the flow of runs and taking crucial wickets in the middle overs, the key to winning in 50 overs cricket. But that just the first half of the story.\n\nBefore the world cup, everything was going good for the spin-duo also popularly known in the subcontinent as Kul-cha. But ever since the World Cup 2019, the team management has started to look at other options and they have their reasons for this hunting.\n\nYajuvendra Chahal had a great start to the world cup. He bowled superbly to pick 4 wickets against South Africa and if not for missed chances he would have taken a fifer. Kuldeep Yadav, on the other hand, was average at most. He was not able to restrict the scorecard and had a hard time picking wickets too.\n\nWhen India was set to play against New Zealand, and Ravindra Jadeja coming into the side in the later part of the tournament, it was obvious that India would be playing only one wrist spinner in the semifinal and the choice was obvious, Yajuvendra Chahal as he was the better of two wrist spinners.\n\nYajuvendra Chahal also went for 63 runs in the semi-final, but he picked the wicket of Kane Williamson, though he himself would rate his performance in world cup semifinal as below average.\n\nIf we rate Chahal’s performance in the world cup campaign starting on high and finished around average, Kuldeep Yadav’s graph only got down from match 1.\n\nAfter the world cup, there were only a few ODI matches in the plan for team India as all team want to play as many T20 as possible to prepare for the coming world cup T20 in 2020.\n\nIndian cricket coach put weight on letting go the strategy of playing two wrist spinners in the playing 11.The batting capabilities of both the wrist spinners just added more woes to them, as India shifted to spinners who know to hold bat too.\n\nAs a result, Yajuvendra Chahal and Kuldeep Yadav were not part of the mix in t20 and the team gave chances to new players.\n\nIn came Krunal Pandya, Rahul Chahar, Washington Sundar. But the new faces in the team didn't up the team performance by much.\n\nThe wicket-taking capability was missing from this new face Indian T20 setup who can bat up to 11, but only in papers. Also, some great batsmen didn't see India's approach to deepen the batting line up at the cost of wicket-taking bowlers.\n\nSelectors and team management noticed this, and realizing there's ample time left before the world cup begins, Yajuvendra Chahal was included against Bangladesh for home series.\n\nKuldeep Yadav was not recalled as he is out of the team due to shoulder injury.\n\nYajuvendra Chahal made a great comeback on his return as he bowled class apart. He was exceptional in all 3 t20s and he has given team India some relief ahead of the world cup.\n\nThis strong comeback from Yajuvendra Chahal and the untimely injury for Kuldeep Yadav has made things hard for Kanpur boy, as the Indian team certainly will not look to play 2 wrist spinners again in the same team for T20s.\n\nKrunal Pandya has performed good and Washington Sunder has improved his batting, making things further difficult for Kuldeep Yadav.\n\nIn the ODI side, it’s obvious now that Yajuvendra Chahal will be given preference over any other spinner as of now, leaving only the test format to fight for Kuldeep Yadav.\n\nRepresenting  Indian again in blue Jersey doesn't look easy for Kuldeep Yadav as of present. He performed well to be part of the team but his world cup performance was certainly below par, but he should think positive from here as he will be given his chances, and he should look to play every match as his last match.\n\nStay tuned.","truncated_text":"Not long before, Kuldeep Yadav was a regular feature in the Indian cricket team for ODIs and T20s. The wrist-spinner along with Yajuvendra Chahal was having a dream run in the field, choking the flow of runs and taking crucial wickets in the middle overs, the key to winning in 50 overs cricket. But that just the first half of the story.","is_published":true,"created_on":"2019-11-20T00:00:00Z","image":"kuldeep-yadav-20-11-19.jpg","slug":"whats-ahead-for-kuldeep-yadav","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":6},{"id":34,"title":"Strike rate and Average in Cricket","extended_text":"Average of a batsman is easy. It’s simply the average of runs. So if a player made 100 runs in the first match, 0 in second and 20 in 3rd match. Total runs he scored is 120 in 3 matches. So his average is 120/3, 40 runs per match on average.\n\nFor a bowler, the strike rate is the average number of balls taken by him to get a wicket.\nSuppose a bowler balls 6 over in 1 match and gets 2 wickets, go wicketless in 2nd match bowling 10 overs and picks up 1 wicket in 3rd match bowling 4 overs.\n\nThe total number of balls he has bowled so far is 36+60+24, 120 balls and he has taken 3 wickets so his strike rate is 120/3 40 balls for a wicket on average.\n\nThe strike rate for a batsman is simply the number of runs he has scored per 100 balls. So if a batsman has scored  6 runs in 1 ball, we can say he will score 600 runs in 100 balls, so his strike rate is 600. So the strike rate is the percentage, runs made per 100 balls.\n\nIf a batsman has scored 320 runs in 500 balls, in 100 balls he has scored on average 64 runs so his strike rate is 64.\n\nAverage for a bowler is the average no runs he has given for a wicket. So if a bowler takes 2 wickets for 70 runs in one match and then 1 wicket for 20 runs in 2nd match. He has total given 90 runs and taken 3 wickets, so his average is 30.\n\nStay tuned.","truncated_text":"Average of a batsman is easy. It’s simply the average of runs. So if a player made 100 runs in the first match, 0 in second and 20 in 3rd match. Total runs he scored is 120 in 3 matches. So his average is 120/3, 40 runs per match on average.","is_published":true,"created_on":"2019-11-29T00:00:00Z","image":"bat-ball_29-11-19.jpeg","slug":"strike-rate-and-average-in-cricket","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":2},{"id":26,"title":"Superover again between New Zealand and England final T20,England won super over to clinch series","extended_text":"England and New Zealand once again gave their cricket fans a thrilling match.Batting first New Zealand batted explosively and scored 146 runs in 11 overs.Guptill scored a 50 and Munro and Seifert also chipped in, scoring 46 and 39 runs in quick time.\n\nIn response, Bairstow started in fifth gear scoring 47 runs of just 15 balls with 5 humongous sixes. Finally it all came down to last over. With 16 needed of final over it looked like a tough task for England. In the end it all came down to 13 of last 3 balls.Under pressure, Chris Jordan proved his ability with the bat scoring 6,2,6 runs to tie the match for his team and giving England to have a show at the super over.\n\nIn super over, batting first England scored 17 of 6 balls and New Zealand in reply, lost  by a fine margin.With so many players performing in pieces, Mitchell Santner was awarded Man of the series for his consistent bowling.\n\nStay tuned.","truncated_text":"England and New Zealand once again gave their cricket fans a thrilling match.Batting first New Zealand batted explosively and scored 146 runs in 11 overs.Guptill scored a 50 and Munro and Seifert also chipped in, scoring 46 and 39 runs in quick time.","is_published":true,"created_on":"2019-11-10T00:00:00Z","image":"Chris-Jordan_10-11-19.jpeg","slug":"superover-again-between-new-zealand-and-england-final-t20-england-won-super-over-to-clinch-series","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":1},{"id":41,"title":"Ishant Sharma 2.0","extended_text":"Sharma is a regular test feature for team India. The veteran who only plays the longer format is now just 4 tests away to complete century of test matches, and he will certainly achieve this feat as India is bound to play 6 test matches in 2020 in New Zealand and Australia.\n\nFor those who don’t follow cricket regularly, they still remember Ishant Sharma for his fiery spell in Australia against Ricky Ponting. The other performance of him alive in memories among fans is his 2 wickets in one over in champions trophy final which set things for India.\n\nApart from those performances, fans don’t have much to remember of him but he is making the mark again. In the last two years, his average in test matches is below 20 and he has taken wickets with a good strike rate of under 35 in the last year.\n\nWhile there are other performers for India, the limelight as of recent all hovered around Jasprit Bumrah, and then we have Mohammad Shami who becomes altogether different bowler in second innings. We have Bhuvneshwar Kumar but he has injury concerns of lately and there are some youngsters too performing well.\n\nAmong all these show stoppers, Ishant Sharma is there in test matches for as long we remember and he has performed exceptionally well in the last two years.\n\nHe has improved his fitness. He had not missed test matches due to injury concerns and he is living his prime at the moment. As answered in a press interview, he is not thinking about playing limited-overs cricket. He is trying to give his best on the field, and if that gives him a call in blue Jersey again, he is up for that challenge too, but the key for him is living in the moment and his test stats in recent times only justifies the thing he said in the interview.\n\nHe has great action. If we recall the best bowlers who can create max problems bowling to left-hand batsman round the wicket, he tops the list.\n\nHis action creates confusion in the mind of left-hand batsmen. From round the wicket and seam at an angle, the batsman plays for inswing delivery but he gets that enough movement to nick one behind the stumps. At times he also bowls big swinging deliveries to trap batsman in front of the wicket or get them clean bowled.\n\nHe has got the experience of playing in all conditions. Whether its Kookaburra ball, Duke or SG, he knows he can handle them all.\n\nHe played beautifully in the recently concluded series against Bangladesh and was Man of the series. This was his first test in home soil after a gap of 12 years. The competition to make into the playing 11 and spin-friendly wickets in India can be the reason behind it.\n\nThere was a time when he was not selected in Ipl but he utilized that time to play county cricket and from there, things have only got better for him. His last IPL also went good for him. He picked up wickets at the start of innings was economical too.\n\nIndia is having a dream run as far as fast bowling is concerned. Never ever  India's pace attack was so lethal. Jasprit Bumrah, Mohammad Shami, Bhuvneshwar Kumar, Umesh Yadav who had good last series, the list is long. But Ishant Sharma with his hard work and focus made sure he doesn't go missing. He is an important part of the Indian test team and if selectors can give him chances again in limited-overs cricket, who knows he can turn things there too.\n\nWell with the form he is in, he is certain to make an impact in limited format too.\n\nStay tuned.","truncated_text":"Sharma is a regular test feature for team India. The veteran who only plays the longer format is now just 4 tests away to complete century of test matches, and he will certainly achieve this feat as India is bound to play 6 test matches in 2020 in New Zealand and Australia.","is_published":true,"created_on":"2019-11-30T00:00:00Z","image":"Ishant_30-11-19.jpg","slug":"ishant-sharma-2-0","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":6},{"id":38,"title":"Test win by innings for India, Australia and New Zealand","extended_text":"India, Australia and New Zealand have won their respective tests by an innings margin.\n\nFor India, it was just a matter of time to pick the rest of four wickets on day 3, to win their first-ever day-night test match and also to achieve the rare feat of becoming the first team to win 4 consecutive matches by an innings margin. Ishant Sharma who was brilliant with the bowl in both the innings bagged the Man of the series.\n\nBangladesh will need some serious improvements in all departments especially their batting department which is too fragile at the moment to provide any fight to the opponent. Their newly appointed test captain Mominul Haque didn't have a dream start to his Test career as captain and also as a batsman as he was dismissed for a duck in both the innings. It's too early on him to raise any question and he will look to come out better in their next test series.\n\nPakistan also was defeated by an innings margin in Brisbane. The Australian pace bowlers proved too good for Pakistan batsman. None of their batsmen were any good with the bat but their best batsman at present in all formats, Babar Azam showed his class and set an example for his teammates on how to bat in these conditions.\n\nHe played superb knock of 104 runs and he got good support from  Mohammad who also played brilliantly but missed his century by 5 runs. Rizwan has been too good on his return and it's a good sign for the Pakistan team. Yasir Shah also hanged in there with the tail but despite all these desperate efforts, Pakistan fell short of 5 runs to make Australia play again to hit winning runs.\n\nThe third test match between New Zealand and England though saw the not-so-thought result as New Zealand beat England by an innings and 65 runs.\n\nComing to bat on day 5, England had 7 wickets to negotiate 90 overs of play, but Santner and Wagner had other plans for them.\n\nSantner in particular who picked up 3 wickets along with his century in the first innings. BJ Watling also played superbly to get a double century to his name. They both helped New Zealand to put a huge total of 615 in the first innings.\n\nWagner also had his contribution on the 5th day to pick 4 wickets.\n\nEngland fans didn't see it coming as they were very confident of their team to force the test match in a draw but New Zealand is a different team after their world cup campaign and they have given warning, that no team should take them lightly in any format.\n\nStay tuned.","truncated_text":"India, Australia and New Zealand have won their respective tests by an innings margin.","is_published":true,"created_on":"2019-11-25T00:00:00Z","image":"ind-aus-nz_25-11-19.jpg","slug":"test-win-by-innings-for-india-australia-and-new-zealand","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":4},{"id":31,"title":"Teams make trading ahead of IPL auction 2020","extended_text":"As IPL auction is approaching teams are making good use of the trade system.After trading Shenon Rutherford to Mumbai Indians couple of months ago,Trent Boult is also traded to Mumbai.\n\nK Gowtham who had ordinary last season is traded to King 11 Punjab from Rajasthan Royals.Ravichandran Ashwin has been traded to Delhi Capitals from Kings 11 Punjab and in return Kings 11 have got left arm spinner J Sucheeth and 1.5 crores.\n\nKings 11 Punjab has also welcomed tall fast bowler Ankit Rajpoot from Kolkata Knight Riders.Ankit Rajpoot is a good bowler and given some guidance, can turn out to be a good buy for Kings 11 Punjab.\n\nThe leg spinner who was sidelined in the last season due to good performance from Rahul Chahar, Mayank Markande has already been traded to Delhi Capitals and he is likely to play all matches having competition from the veteran Amit Mishra to make into the playing 11.\n\nIn a surprising call, Ajnikya Rahane has been traded to Delhi capitals.The Indian test vice captain had poor show with the bat till he was captaining the side in last season, but in the later part of the tournament when Smith took over, he played brilliantly and also scored a century. Delhi Capitals will look to make good use of him.\n\nHomecoming for Dhawal Kulakarni as Mumbai Indians welcomed him from Delhi capitals.\n\nStay tuned.","truncated_text":"As IPL auction is approaching teams are making good use of the trade system.After trading Shenon Rutherford to Mumbai Indians couple of months ago,Trent Boult is also traded to Mumbai.","is_published":true,"created_on":"2019-11-15T00:00:00Z","image":"IPL_auction_ 2020-15-11-19.jpg","slug":"teams-make-trading-ahead-of-ipl-auction-2020","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":2},{"id":45,"title":"Jasprit Bumrah - Gold or Gold plated?","extended_text":"\"In his destructive spell, Bumrah reminds everyone of his brilliance,\" said Vivian Richards once in an interview.\n\nJasprit Bumrah, the former number 1 ODI and T20 bowler, has been an asset to the Indian team since his debut. In his debut ODI series against Australia in 2016, former captain and wicket-keeper Ms. Dhoni adjudged him as the \"Find of the season\" owing to some of the most brilliant bowling spells the world had seen in recent times.\n\nRight from the unorthodox action to a short crisp run-up, Bumrah was always destined for greatness. The world is evidence of his bowling prowess for India in national colors as well as for his IPL team, Mumbai Indians.\n\nHe has kept on adding up more and more to his armory right from skull-crushing bouncers to toe crushing yorkers, inswingers outswingers and the deceptive slower ones have all emerged to be his tools to absolute success.\n\nBut earlier in September 2019, Bumrah played a test against WestIndies where he picked up a hat-trick and later in the match reported of back stiffness.\n\nAs a result, he was tested for the next series against SouthAfrica and since then he was out there rehabilitating at NCA in Bengaluru. Later he traveled to the UK in October 2019 to seek opinion about his \"minor stress fracture\" with Ashish Kaushik the head physiotherapist at the NCA.\n\n After the WI series, Bumrahs comeback match finally arrived on January 7 against Sri Lanka where the first delivery he bowled went swinging down the leg side and Pant made a further mess of it by giving away an extra run. Jasprit Bumrah was back but this was a way rustier version of him, obviously after a long cricket less patch.\n\n He finished with figures of 1-32 in his 4 overs, very contrasting to the Bumrah we know. Then he traveled with the team for the ongoing NewZealand series.\n\n India whitewashed NewZealand in 5 matches T20 series with Bumrah showing signs of coming back to his self and chipping in with wickets.\n\nHe even bagged the Man of the Match in the final T20 for his economical spell of 3-12 in 4 overs. However, in the ODI series, NewZealand batsman counter-attacked him, Indian bowlers failed to make any impact resulting in a whitewash of 3-0 by Newzealand.\n\nBumrah went wicketless and couldn't manage even a single wicket in the 30 overs he bowled in the series. Does this drip in form is natural soft stint after someone makes a comeback from the injury or batsman have figured out the ways to tackle him which are even counter-attacking him for boundaries.\n\n Since in India cricket is a very emotional game, the fingers start to rise sooner than expected. One bad match and fans and media and critics will be all over you.\n\nThe cricketer in himself should not be affected by what being said outside the circle, but the talk starts to get you at some point in time and Bumrah has been under the radar for the very first time in his career.\n\nThe little blame goes to Indian cricket management too with everyone starting to praise cricketer with no boundaries. Bumrah has been exceptional with his bowling skills but the people in the Indian team have been too vocal about how he is like the greatest fast bowler India has ever seen.\n\nThe talk and all that praise is a confidence-booster in the starting but after some point, it tries to encircle you and try to put pressure on you, the pressure to perform consistenly.\n\nTim Southee in his recent interview said that Bumrah remains a world-class bowler, despite not being in the good form, the pace swing has been on point and such bowlers need one good day at the office to be back at it with a bang.\n\nHowever critics suggest that they have still not seen any evidence of the ruthless Bumrah they know, the yorkers aren't coming as they used to and the bouncers aren't as spearheaded anymore.\n\nIf we try to analyze Jasprit Bumrah and look at his strength, he has a good bouncer as he can perfectly create that awkward angle to hit the batsman head at will, he has yorker but with his action, if the batsman runs towards him and show some fast hands, he can be tackled.\n\nHe has a good slow bowl and he has deceived the batsman number of times with the slow ball.\n\nWe remember one match in IPL when Kedar Jadhav was facing Jasprit Bumrah and Jadhav was playing him all around the park with ease. That was the first time, we saw Jasprit Bumrah little helpless as Jadhav was making a mockery of him.\n\nThe action which Jasprit Bumrah has can do wonder only if the speed is in access of 140 if his speed drops below 140, the same action which provides him with awkward bouncers and yorkers becomes relatively easy for the batsman to play as the bowl comes nicely on the bat.\n\nBumrah action needs the speed of 140+ as the bowl comes nicely on the bat and that is what happening with him now.\n\nThe slight drop of pace and not the same bull's eye line length bowling has allowed batsman to get the better of him and that is the reason he is going wicketless after wicketless.\n\nThis has not only put a player like Jassi under the scanner but also serves as a blow to the esteem of a world-class bowler like him. Maybe these are just bad days or as you might say rough patches that do come in a player's life. Maybe all he needs is to buckle up and start with a new edge to this new phase of his career.\n\n \nWe all know what a fighter Jasprit Bumrah is and it's all worth the wait. One match, one 2-3 wicket haul is everything that will help him to get the rhythm back.\n\nAs Akash Chopra quotes, \"sab ko karde gumraah, apna Jasprit Bumrah\" we wish we get to see back the old Jasprit very soon with the same intensity in run-ups, his laser-guided missiles and toe crushing yorkers and the slow delivery. The last one is his best skill.","truncated_text":"Jasprit Bumrah, the former number 1 ODI and T20 bowler, has been an asset to the Indian team since his debut. In his debut ODI series against Australia in 2016, former captain and wicket-keeper Ms. Dhoni adjudged him as the \"Find of the season\" owing to some of the most brilliant bowling spells the world had seen in recent times.","is_published":true,"created_on":"2020-02-29T00:00:00Z","image":"jaspret.jpg","slug":"jasprit-bumrah-gold-or-gold-plated","author":{"id":0,"name":"Naman Kapri","name_key":"naman","is_admin":false},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":10},{"id":46,"title":"The art of elegant stroke play - Smriti Mandhana","extended_text":"Jersey number 18 has been special in the Indian cricket circuit with the two best players in their respective categories donning it, be it the modern-day maestro, Virat Kohli or our very own Smriti Mandhana.\n\n A 23-year-old bespectacled girl with a pretty smile and determined eyes made her ODI debut on 10th April 2013. She had given up on a possible career in hospitality, as she was from a science background but little did she know what cricketing luck had in store for her. \n\n Smriti Mandhana is a dynamic T20 player of modern times. In the 72 matches she had played, she has managed to score 1677 runs with the highest score of 86.\n\n\n She has interesting figures even when it comes to her contribution to her Big Bash team Brisbane Heats. She has played 51 ODI's in national colors for India till date and has amassed 2025 runs already with 17 50's and 4 100's. \n\n She is the only Indian cricketer, along with Harmanpreet Kaur to have played for the Australian Big bash league, has a world cup 100, another 100 in Australia and even a 200 in the domestic cricket circuit all under her belt at such an early age of her career!\n\n Smriti, otherwise a right-handed person, started her career as a left-handed batsman. She scored a half-century on her test debut vs England which played an important role in giving India a historic test win in England. \n\n Smriti Mandhana's arrival has marked a new phase in the history of Indian Women Cricket. At the start of 2018, the Indian women’s team was without an ODI series win outside Asia.\n\n These numbers have changed for good since then and India have gone on to win two straight ODI series against South Africa and New Zealand respectively\n\n Both the series victory's involved an outrageous team effort in all the three departments- batting, bowling, and fielding but the one thing that stood out and was noticeable in both these series wins was the contribution and consistency of the elite opener Smriti Mandhana. \n\n Smriti Mandhana scored a massive 219 runs in South Africa in 2018 at a whopping average of 73.00 with a hundred and a fifty. She repeated the fest in New Zealand in 2019, again scoring 195 runs at an average of 85.00 with one hundred and fifty.\n\n Such performances just do not contribute to the team victory but also show the elite club Smriti is slowly entering into. \n\n With the start of 2018, she has been in the more purplest patches of her cricketing career so far. She is middling the balls, putting them into gaps easily and as the analysts say, \"she is seeing the ball like a football\".\n\nIf we try to bisect Smriti Mandhana game it's all about timing. The timing in her shots and the range of shots she has is what makes her a good ODI and one of the best t20 players at the moment.\n\nShe has not got the power game like Harmanoreet Kaur but the sheer timing in her shots sets her apart. Though it is unfair to compare women cricketers to Indian men cricketers, the timing Smriti Mandhana has in her shots, gives a little hint of Rohit Sharma.\n\n In the recently concluded New Zealand series Smriti Mandhana after scoring a century and an unbeaten 90 had moved up three places to top the charts in the list of \"Best ODI Women batter \".\n\n Her stay at the top was though short-lived and currently, she is the 4th best batsman around the globe in the ICC rankings for both ODI's and T20's.\n\n Her boom in fame arrived with the advent of the Cricket world cup 2017, we're coming back from an ACL injury, she bagged the Man of the match in the first match itself against England for a brilliant 90 off just 72 deliveries. \n\n She did get that waiting century in the second league game against West Indies and received the second man of the match award in a row.\n\n Although India was defeated in the finals by England and missed the silverware by an inch, Smriti was praised for her temperament and presence of mind on the field.\n\n Later in 2019 Mandhana scored a match-winning knock of 73 against West Indies, not only did this knock come in a winning cause but also made her the 2nd fastest Indian cricketer to 2000 ODI runs, in fact, 2 innings faster than Virat Kohli. \n\n Mandhana was the only Indian player to be named in the ICC Women's Team of the Year 2016.\n\n In June 2018, BCCI acclaimed her as the Best Woman's international cricketer. In December 2018, the International Cricket Council (ICC) awarded her with the Rachael Heyhoe-Flint Award for the Best Female Cricketer of the year. \n\n She was also named the ODI Player of the Year by the ICC at the same time. She remains a pillar in the Indian cricket team and often reminds us of legendary aggressive opener Virender Sehwag. \n\n She has been a world-class T20 player in recent times recording some milestones in Indian colors as well as for her Big Bash team, Brisbane Heats.\n\n The undefeated attitude on her face and determination in her eyes is everything to die for. Her passion for cricket and hunger for runs is gonna benefit India in years to come.\n\n Stay tuned for more.","truncated_text":"Jersey number 18 has been special in the Indian cricket circuit with the two best players in their respective categories donning it, be it the modern-day maestro, Virat Kohli or our very own Smriti Mandhana.\n","is_published":true,"created_on":"2020-03-01T00:00:00Z","image":"smriti.jpg","slug":"the-art-of-elegant-stroke-play-smriti-mandhana","author":{"id":0,"name":"Naman Kapri","name_key":"naman","is_admin":false},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":8},{"id":47,"title":"Test cricket - Should attack or Should defense?","extended_text":"A Test match is the mother of all formats of the cricket. Living up to its name, not only does it test a player's temperament but also his determination and patience to stay on the wicket, to play that extra session, which could work wonders for the team. \n\nIndia has been a test cricket giant along with other teams like Australia, South Africa, England. Since Nov 2016 Indian team has displayed a mesmerizing level of consistency by maintaining their number one position in test cricket and removing every negative that came in their way. \n\nThe transition of captaincy from Ms. Dhoni to Virat Kohli in 2015 when India was in the 7th position in the Test rankings to now when India owns the Test Mace, has been one hell of a ride. \n\nA lot can be attributed to the elite captaincy of Virat Kohli and his aggressive yet effective ways of dealing with criticism. \n\nBut what is a captain without his team? If we focus on how India's test team looks like we can see that there have been a set of players who play all the three formats with consistency in all of them, a major example being Virat Kohli, Jasprit Bumrah. \n\nThen come to those players who play only in the test circuit throughout the year and even play county cricket in the offseason to better their armory with the prime example being the likes of Cheteshwar Pujara and Hanuma Vihari. \n\nThe last but not the least are those who have been constantly in and out of the team due to their form, availability, and requirement. \n\nFor instance, although Kuldeep and Chahal have done wonders for the Indian team in ODI's when it comes to testing cricket, Ravichandran Ashwin and Ravindra Jadeja have always been given an edge over them especially in overseas series due to more experience and better plan of action in tough situations. \n\nBoth Jadeja and Ashwin have been great in-home soil and the figures of Jadeja even expel Ashwin on home soil but overseas the story is different.\n\nAshwin's performances outside Asia has been not good. Jadeja also loses its shine in the overseas tour but with improved batting in the last one year or so he beats Ashwin if the team management looks to play alone spinner.\n\nWithin these circles of test cricket, the players with the highest amount of pressure on them remain the ones who stick to playing only test cricket. \n\nSome of the prime examples of such players as we said earlier in the modern-day wall of Indian cricket Cheteshwar Pujara. He is a type of batsman who can make the bowler feel helpless by just ducking and leaving the deliveries. \n\nHe has often been criticized for his slow and cautious approach in the test format but that has helped his cause. He is unarguably one of the best test batsmen India could have got in the past few years. \n\nIn the famous Australia test series win in Australia, he had a wonderful series with three hundred. He even surpassed Kohli with his performances and remain the key player for India through the series.\n\nThe latest addition to the Pujara type player in the Indin test circuit is Hanuman Vihari. He also likes to take his time on the pitch, understand the bounce and play accordingly. \n\nOne wouldn't usually see them go after bowlers or get dismissed playing a rather rash shot as they try to refrain from it as far as possible. That is just not their game.\n\nThis component of gameplay has born fruit for players like Pujara, especially in overseas conditions. He was dropped in the 2016 season due to lack of form, but then after seeing Virat Kohl's struggle against the new swinging ball in overseas conditions was when people realized the importance of having a technically sound player like Pujara in the squad.\n\nAfter the Australia series, even his critics \n\n He came back stronger to score 1170 runs in the 2017 season, that too taking 2 innings less than Steve Smith. These are types of batsmen who would play make pass the sessions of the swinging seaming balls making it easier for the players to come.\n\n He did such tasks for India in many series abroad paving the way for players like Ajinkya Rahane to play freely and go on to score big.\n\nThe innings he played in Australia even won him his hard critics who were always after him for playing slow cricket.\n\nIn the recently concluded India New Zealand test, where India had to see the face of defeat after a long time Virat Kohli was quoted saying, \"Being cautious won't help us\".\n\n He elaborated by saying that playing the game with a defensive mindset is not gonna help the team and is not at all beneficial for the future. \n\nHe added that players took up to ultra-defensive gameplay to adjust to the wicket which is working against India especially in overseas conditions. Direct links to Pujaras innings can be made here as he took 28 deliveries to score the first run of his innings and later got dismissed for 11 from 81 balls. \n\nSomewhere or the other this affected the already set nonstriker's, Mayank Agarwal's state of mind and he had to go for the shots to compensate for the lost deliveries to which he later lost his wicket too. \n\nVirat also added that it's always a smart choice to assess the pitch conditions, but if one starts thinking about it a bit too much and that starts showing on his batting causing him to not focus on it, it can serve as a major blow to the team as well as the player's confidence. One can sometimes get into too many technical discussions but if the mind is clear, the gameplay and plan of action can be pulled off smoothly was what Virat had to say.\n\nNow, this brings us to the fact that is cautious play hurting India or is it just one bad day at the office for the player out there. Contrasting to this, the world has also seen several legendary naturally attacking players like Virender Sehwag and Brendan Mccullum who chose the aggressive way no matter what format it was. \n\nThey knew how to kill the opposition's back by counterattacking their frontline bowlers. One can never doubt or term their approach to the game as faulty or obsolete. \n\nThey were successful in their ways by creating a sense of fear among the bowlers and providing 100% entertainment to the audience as well.\n\n Virender Sehwag holds the record of being the first Indian Test player to score a triple hundred and that too the fastest 300 in the history of Test cricket in just 278 deliveries against a formidable South African side in Chennai. \n\nHe was a type of player who would attack every delivery rarely missing out on any. Brendan Mccullum is another player who has a triple century for the Kiwis in the international circuit. His level of fearless cricket can be judged by the fact that with 107 sixes, he holds a World record for most sixes in Tests. He also has the quickest century in test cricket under his name in just 54 deliveries in his farewell test against Australia in 2016.\n\nAll of this just proves the fact that cautious play is no parameter to judge a test player. One can be as good a test player by playing aggressive cricket than one who likes to stay in the middle for a while.\n\n Each player has their way to inch towards success. We can't criticize a player's approach towards the game unless the technique is at fault. As for the Indian team, technically sound players like Pujara, Pujara is the backbone of the Indian team in test cricket whereas aggressive players like Rohit Sharma, Pant give stability and keep the run rate in check thus ensuring the scoreboard keeps ticking.\n\nThe recent success Rohit Sharma had in series against SouthAfrica he makes an exception here. The player who can play long innings with a good strike rate.\n\nStay tuned for more","truncated_text":"A Test match is the mother of all formats of the cricket. Living up to its name, not only does it test a player's temperament but also his determination and patience to stay on the wicket, to play that extra session, which could work wonders for the team. ","is_published":true,"created_on":"2020-03-01T00:00:00Z","image":"teamindia.jpg","slug":"test-cricket-should-attack-or-should-defense","author":{"id":0,"name":"Naman Kapri","name_key":"naman","is_admin":false},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":13},{"id":48,"title":"Navdeep Saini, the latest addition to Indian pace battery","extended_text":"Navdeep Saini has been performing in whatever games he has got to play for India so far. He is a\nstrong wire who runs rhythmically to the pitch and has a beautiful action to finish.\nHe has all the traits to become a genuine fast bowler for team India and in t20, he now has a\nstrong case to be included in the World t20 cup squad.\n\nWhat separates him from other fast bowlers is his beautiful wrist position. In cricket, you are not\nallowed to bend the elbow but your wrist is free.\nIf you can use the flexibility of your wrist to put that last-second effort which certainly adds few\nyards to your bowling, you hit the 140+ mark, which combined with a little swing or seam\nmovement is lethal in any part of the world.\nHe had a little bit of fairy tale to his career so far. He used to play tennis ball cricket, then on the\nsuggestion of an eye for talent, he tried from Delhi and impressed selectors.\nGautam Gambhir tweeted on how he has to fight with few selectors to get him into the Ranji\nteam, not shying away from naming specific nouns.\nIndia\u0026#39;s fast bowling department now has enough stocks available that they do not need to worry\neven if someone remains off-field for whatever reasons.\nDeepak Chahar has been a good inclusion, good outswinger but he went for some runs in the\nrecently concluded matches.\nShami is at the peak time of his career and of course, there is Bumrah. Umeh Yadav,\nBhuvneshwar Kumar, Shardul Thakur the list goes on, and now we have Navdeep Saini who\nbowls 145+ and has a good Yorker and slow delivery.\n\nThe prospect looks fine on the paper for Saini and at the moment it is fine on the field too.\nIt will be too early to heap praises on him but he has got that basic element in him which is\nneeded to become a good bowler.\nHow he handles pressure and how he goes on from here is what international cricket is all about.\nStay tuned.","truncated_text":"Navdeep Saini has been performing in whatever games he has got to play for India so far. He is a strong wire who runs rhythmically to the pitch and has a beautiful action to finish.","is_published":true,"created_on":"2020-01-12T00:00:00Z","image":"navdeep.jpg","slug":"navdeep-saini-the-latest-addition-to-indian-pace-battery","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":3},{"id":50,"title":"India U19 registers their first win, beats Sri Lanka comprehensively","extended_text":"India has started its world cup U19 2020 campaign on a positive note. After scoring 297 runs batting first, they restricted Sri Lanka to 207 runs to register their first victory by a massive margin.\n\nTeen prodigy Yashasvi Jaiswal hit his first half-century of the campaign.\n\nIndian team saw contribution from every batsman with Priyam Garg the skipper also passing the 50 run mark.\n\nBut some innovative shots at the end of the innings by Siddhesh Veer stole the show. He played scoop,  reverse scoop with full control.\n\nSri Lanka also started on a positive note but they lost their way in the middle. Their captain Nipun Dhanajaya though looked like a  class apart with his elegant stroke play.\n\nSiddesh Veer who provided the necessary momentum at the backend of the innings also picked up 2 wickets.\n\nHe was also named as the Man of the match.\n\nStay tuned.","truncated_text":"India has started its world cup U19 2020 campaign on a positive note. After scoring 297 runs batting first, they restricted Sri Lanka to 207 runs to register their first victory by a massive margin.","is_published":true,"created_on":"2020-01-19T00:00:00Z","image":"indvssl_19-01-2020.jpeg","slug":"india-u19-registers-their-first-win-beats-sri-lanka-comprehensively","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":1},{"id":49,"title":"Kohli at No 4, the change which can do more harm than fix","extended_text":"The Australian team is now in India to play the ODI series followed by a t20 series. They have started the things on high as they gave the hosts an unwanted record of the 5th 10 wicket loss, which came as a shock for\nTeam India who was enjoying a dream run playing with WestIndies and Srilanka.\n\nIndia was asked to bat first on the batting-friendly flat wicket of Wankhede. Things started well for India as Rohit Sharma played a lustful cover drive to score the team\u0026#39;s first runs. But unlike the Rohit Sharma we know, he had a soft dismissal when he was looking good.\nShikhar Dhawan and K L Rahul who both are fighting for the same spot in team India tried to rebuild the innings, but the very old Indian technique of saving the wickets hit later backfired for team India, as none of their batsmen stayed till the very end to provide the necessary momentum.\nAfter the 50 overs, India had only 255 runs on the board and it looked like a slightly below-par performance but that is just the first half of the story.\nWhat followed in the second half of the innings was sheer domination from Warner and captain Finch who will play alongside Kohli in IPL 2020. In the end, Warner and Finch remain unbeaten, both scoring centuries to give Indian fans a huge setback as the home team was thrashed by 10 wickets.\nAll Indian bowlers had a tough day on the field. Not a good comeback from Bumrah so far and very surprising of Kohli to not give Navdeep Saini a chance who has been Man of the series in the recently concluded Srilanka series.\nAnother strange thing that happened was Kohli came to bat number four position. Not just fans, everyone was shocked to see this change of batting order from team India captain who tried to fit both the openers, Shikhar Dhawan and K L Rahul in the team.\nThe move didn\u0026#39;t do any good for India as Dhawan and K L Rahul didn\u0026#39;t play\naggressively and were too respectful at times, both trying to save their place in the squad. Kohli at no 4 was dismissed by a smart overhead catch from Zampa who emptied his pockets with Virat Kohli in it along with hairband and chewing gum in the hotel room.\nThe 10 wicket loss is an eye-opener for team India who didn\u0026#39;t have any ICC trophy after 2013. They were outplayed in all the three departments and it will be interesting to see how India bounce back from here.\nStay tuned.","truncated_text":"The Australian team is now in India to play the ODI series followed by a t20 series. They have started the things on high as they","is_published":true,"created_on":"2020-01-16T00:00:00Z","image":"kholi.jpg","slug":"kohli-at-no-4-the-change-which-can-do-more-harm-than-fix","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":4},{"id":51,"title":"Team effort wins India their first T20 against New Zealand","extended_text":"In the first T20 of the New Zealand tour, India chased down 204 to go 1-0 up in the 5 match series.\n\nWinning the toss, Kohli asked the Kiwis to set up a total.\n\nThe Black Caps didn't disappoint their fans on their home soil as Colin Munro and Martin Guptill fired in all cylinders from ball one.\n\nColin Munro smacked a fast half-century and New Zealand looked certain to pass the 200 run mark.\n\nKane Williamson and Ross Taylor, the pillar of New Zealand batting carried on from the good work done by the openers, both scoring half-centuries to take the score to 204 runs and India knew they have a challenge ahead of them to chase this massive total.\n\nIndia had a bad start as the last match Centurian Rohit Sharma was undone by the law of averages, falling to Santner playing a cross-batted shot.\n\nFrom then, King Kohli and K L Rahul who was back at the opening position made sure India stays on par with the required run rate.\n\nNew Zealand did come back in the match with wickets of Kohli, Rahul, and Dube but innings of fine class from Shreyas Iyer did the job for India in 19 overs.\n\nThough this win can’t level the World cup defeat but good for Indian fans as they don't want to see their team get defeated again against nice guys.\n\nWith Shardul Thakur going for runs, Navdeep Saini may get a feature in the next contest.\n\nTill then, Stay tuned.","truncated_text":"In the first T20 of the New Zealand tour, India chased down 204 to go 1-0 up in the 5 match series.Winning the toss, Kohli asked the Kiwis to set up a total","is_published":true,"created_on":"2020-01-24T00:00:00Z","image":"Shreyas-Iyer_24-01-2020.jpg","slug":"team-effort-wins-india-their-first-t20-against-new-zealand","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":2},{"id":56,"title":"Pragyan Ojha -  A career ended too soon ??","extended_text":"\"Never judge a person by his actions,\" said a wise man once. In terms of cricket, this can be rephrased as \"Never judge a bowler by his actions\". ICC has clear rules on the clear actions and description of violation rule of not bending the elbow more than 15 degrees.\n\nThe 15-degree rule has saved so many bowlers up to now but there have been bowlers who were breaking the rule from the time they started playing cricket and they were not ruled out until a sharp umpire noticed something fishy in the rotating arm.\n\nLast week marked the retirement from all forms of cricket, of once our go-to test cricket bowler, Pragyan Ojha.\n\nPragyan was a slow left-arm orthodox bowler with an interesting run-up, where he ran sideways from round the stump to over. His path went right through the gap between the non-striker stump and the umpire to eventually deliver the ball.\n\nHe played for Hyderabad which is his Ranji Team and he was once ICC ranked 5 best players in the world. He is also the first and one of the only two spinners to have received the purple cap in the prestigious Indian Premier League. All of this proves his essence on the international as well as the domestic stage in the bowling aspect of the game.\n\nHe also has a rare feat under his name where he took figures of 5-40 and 5-49 in Sachin Tendulkar's last test of his career against the Windies which made the occasion more special. He was given the IPL jury's best bowler back in 2010 for his amazing show in the IPL.\n\nBut back in 2014, Ojha's action was reported by the former Test umpire AV Jayaprakash during a domestic cricket game. Later it was found that his action was under the scanner for the past one year. The matter was looked into and unfortunately, he was banned from bowling by the International Cricket Council (ICC).\n\nAccording to the ICC officials, Ojha's elbow bent more than the permissible limit of 15 degrees.  As a result, he was left out of his Ranji squad which was to play services that year and also his IPL team Mumbai Indians dropped him following the incident.\n\nHe was restricted from playing any competitive any form of competitive cricket until he undergoes rehabilitation and works on his action.\n\nThis was a major blow to the bowler's career and also to India as the team lost one of its potential players due to a minor flaw. He came back into the Ranji side later with a modified action and run-up but wasn't as lethal as before and couldn't we'll make that cut in the international circuit anytime after that. Hence this well-marked the end of his bowling career.\n\nThe ICC's rule is not to be blamed here because spotting and reporting of action is their job and is fine but if a player is asked to change his action Midway in his career at his potential peak, it's a direct attack on his self-esteem and performance at the same time.\n\nMaybe some steps could be taken at an early stage by informing bowlers of suspected actions when they play at the junior levels or at elementary level tournaments which makes things easier for them going into the bigger stage.\n\nThe set of rules of ICC regarding bowling actions should be enforced upon in the early stages of Cricketing careers by these domestic level institutions so that they do not emerge into the International stage with faulty actions only to get suspended later on.\n\nThese institutions should be set up by all Cricketing boards like BCCI, PCB, CAB to prevent such cases in the future which is better for the game.\n\nOjha is not the only player to have been affected by the Action change rule. Another victim of this is Pakistani leg spinner Saeed Ajmal who was one of the Legends of all time for Pakistan. During their series against Australia in UAE, even his elbow was found to be bending for than the allowed 15-degree zone and he was suspended by the ICC with immediate effect. This was a huge blow to Pakistan as Ajmal was the ICC 1st ranked bowler at that time and Pakistan went on to lose the next series in absence of him.\n\nAjmal returned in 2015 with a reassessed action but this time he wasn't as effective as before which led to his retirement very soon. He gave a controversial statement while announcing his retirement where he said he blamed the ICC bowling action for destroying his bowling career.\n\nThis is where the absence of a domestic institution within the ICC comes into effect. Players affected by the law's blame ICC for it's set of rigid laws but fail to understand that the rigidity of laws helps in maintaining the spirit of the game around the world.\n\nIf domestic level institutions were present below the ICC instead of blaming the ICC the players could have simply approached them along with suggestions to improve their game by helping them play domestic matches before they can enter the international stage once again. All these problems would come to a halt since the domestic players would start their careers with the action within the ICC set of rules and thus gain more experience with that action without fear of getting suspended ever later on in their careers.\n\nIn the most recent cases, West Indies strike bowler Sunil Narine was reported of faulty action during the PSL match of Lahore Qalandars vs Quetta Gladiators and was later suspended for the same. He was reported twice back in 2014 during the Champions League, had to pull out of world cup 2015 squad to give himself time to work on his action too. He had a lot of history concerning his action which was reported several times and was very debatable. Finally, he came back with a brand new action when he was cleared off the PSL action accusation. This time he was back even stronger. He had a brilliant show in IPL 2019 doing wonders for his IPL team Kolkata Knight Riders. \"Sunil Narine deserves credit for maintaining high standards despite the change in bowling action,\" said KKR bowling coach on being asked about the bowler's work rate over the past few years. Thus it's not always that an action change has been negative for the player affected. I\n\nn this case, he came back with a new action and kept up his reputation of \"Mystery Spinner\" with better action and one within ICC's ground rules for bowling.\n\nNarine is an example of how well the ICC rules have been formulated and how player-friendly they are in the bowling aspect. Although he was reported he was being sent to testing centers to improve his act and come back once again, stronger and improved than the last. The domestic institution could have again done the same thing for him with the same effect and if that would have been done on time, Narine would not have well missed the World cup 2015 or the Champions trophy 2014.  \n\nThere were other bowlers like Shoaib Akhtar, Marlon Samuels, Muttiah Muralitharan who have done wonders for the team but have gone under the scanner for their actions. All these players are those who were suspected of faulty actions when they were in the purplest patches of their Cricketing careers.\n\nThis not only effects the teams whom they represent by effecting their starting 11 combinations but also makes the comeback of such bowlers difficult as with a new action, there are side effects like decreased pace, swing, spin, etc making them a different bowler altogether. Another Sri Lankan fast bowler, Lasith Malinga who has a round arm action and still bowls with one without any bans has often acquired questions like why is Malinga safe even after his controversial bowling action.\n\nThe answer to this is simple. Although he has a round arm bowling action the angle of his elbow bend is still less than 15 degrees which makes him eligible to bowl no matter how his hand movement is.\n\nOn concluding all these circumstances what one can justify is ICC is nowhere to be blamed in the system of bowling faults. The best that can be done is to set up domestic level institutions by the BCCI and other boards to ensure each young talent is looked upon closely and steps are taken to correct the actions early on in their careers rather than then when they are already within the international circuit. This improves the brand of Cricket players across the globe, enriches young talent around the country and decreases the number of players accusing ICC rules of destroying their careers and lowering the essence of those laws.","truncated_text":"\"Never judge a person by his actions,\" said a wise man once. In terms of cricket, this can be rephrased as \"Never judge a bowler by his actions\".","is_published":true,"created_on":"2020-03-05T00:00:00Z","image":"ojha.jpg","slug":"pragyan-ojha-a-career-ended-too-soon","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":14},{"id":55,"title":"Elysse Perry - The all rounder you want.","extended_text":"Every team around the world, be it men or women have that one player in their team who always proves to be the X factor. Such players are generally all-rounders because they have their say in all the three aspects of the game: batting, bowling, and fielding.\n\nIndian men team has Ravindra Jadeja, Indian Women team has Deepti Sharma, the Australian women team similarly has Ellyse Perry who can be so-called the backbone of the team.\n\nShe is truly a player with strong basics and sharp technique with the match-winning abilities and has proved herself time and time again.\n\nPerry is one of the most special players in the Australian Sports Industry. She is the only player to have played International level football as well as Cricket for the country.\n\nShe got her ODI cap in 2007 and later got her Football cap a month later. She is also the only Australian to have represented them in both Cricket and Football World cups.\n\nShe plays in the WNCL for New South Wales. She shot into fame with her amazing performances in the WNCL (Women's national cricket league) in the final of which she took 4 wickets for just 23 runs and impressed the selectors.\n\nShe was then inducted into the 2009 ICC World T20 but wasn't as efficient there and ended the tournament with 9 wickets only. She came back stronger again in the WNCL next year with 22 wickets in the tournament. She also went on to score 148 runs in the tournament helping to boost the team's total as and when required.\n\nIn the World T20 next year she was at her level best with some amazing batting and bowling performances. She managed to take 3 wickets in the finals against West Indies thus making Australia pip Windies by 3 runs to lift the trophy.\n\nShe played a very important role throughout the tournament continuously bowling tight spells, batting at the right moment and saving runs with her athletic fielding.\n\nDuring the WT20 2018, Perry became the only Cricketer for Australia, male or female to play  100 twenty 20 international matches and she also became the first to take 100 wickets in the final of the same tournament.\n\nShe was in one of the purplest patches of her career during that period. She is a right-handed batsman and also bowls right-handed medium pace. She has all the deliveries a good bowler has in her armory. From yorkers to bouncers, inswingers to off cutters she can do it all. She is a master of disguise. Her slower one often gets her wickets due to her skill of bowl deception.\n\nIn the ongoing WT20 world championship, she was impressed with the ball in her first match against India with bowling figures of 1-15 in 3 overs but failed terribly in batting and was bowled first ball by Poonam Yadav.\n\nIn the second match against Sri Lanka, she had figures of 4-23 and stayed not out till the end to ensure Australia goes over the line smoothly.\n\nFurther, she even had figures of 3-12 in her four overs in the next match. She has been at the top of her bowling form if not her batting.  In the recent match against New Zealand, Perry had to leave the pitch due to a hamstring injury while fielding the ball.\n\nReports state that the injury is grave enough and she has been ruled out of the championship for the same. This is a major blow to Australia's hopes of retaining the title in the absence of their star player.\n\nPerry has proved herself every time on the international stage. She has never been a player to be surrounded by controversies. Australia was on a search for an apt replacement or an alternative for fast bowler Cathryn Fitzpatrick, who retired in March 2007, and Perry made sure she settles well into the shoes of Cathryn.\n\nShe had to juggle between two sports at the starting of his career playing national level cricket for Australia and also playing football for Sydney Fc in the women's league. Perry's amazing form in the 2015-17 season ensured Australia resolve all their no. 4 problems and finally get a technically sound batsman to bat at the no. 4 positions.\n\nShe has dropped her bowling pace too over the years but still is as lethal as always emerging as one of the Australian gems and the greatest women superstars Cricket had found so far.\n\nStay tuned.","truncated_text":"Every team around the world, be it men or women have that one player in their team who always proves to be the X factor. ","is_published":true,"created_on":"2020-03-08T00:00:00Z","image":"perry.jpg","slug":"elysse-perry-the-all-rounder-you-want","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":7},{"id":57,"title":"Chamari Atapatuu - The lone warrior.","extended_text":"The Sri Lankan Cricket team has seen a massive decline in recent years in both men/women categories in all aspects of the game. The downfall can be attributed to poor show with the bat in the recent history as well as with the ball against formidable sides. Only a few players have taken up the responsibility to step up their game, come forward and initiated to drive the team towards victory.\n\nOne such player in the Sri Lankan women's team is their captain Chamari Athapaththu.\n\nIn the ongoing WT20 championship, the skipper has been in top form since the word go. In their first match against Bangladesh Chamari bowled a quick spell of 3 overs, giving away just 15 runs and limited Bangladesh to a below-par total of 91 runs. Chasing this short total she made a 60 run opening stand before getting dismissed on 30 after almost seeing Sri Lanka through the match. In the second match against India, she again scored an amazing 32 with 5 fours and 1 six but there was no other impressive performance on the other end to support her, causing SriLanka to be restricted to a low total of 113 which was chased easily by the in-form Indian batsman handing Lankans their first defeat in the tournament.\n\nIn the third match against Australia,  Chamari again gave the Lankans a fast yet organized start by scoring a brilliant half-century in 38 deliveries with 7 boundaries and 4 sixes at a whopping strike rate of 131.58. If any other batsman had shown a bit of intent on the pitch to support the skipper Lankans could have ended at 160 in place of the 122. No other batsman in the Sri Lankan hut was brave enough to support her while she was playing her shots at one end. She got dismissed in the 14th over after which the innings fell apart like a pack of cards. Sri Lanka lost yet another match with the Australians ending the match in 19.3 overs itself.\n\nIn the next match against New Zealand, Chamari in the best of her form continued with again a top knock of 41 including 5 fours and 2 sixes as the others failed to get going.  She also got a wicket in the three overs she bowled and was sharp in the field too.  Sri Lanka thus went on to lose the third match in the row despite the 30-year-old giving it her everything. All of these mishaps kept Sri Lanka away from the qualifications for the quarter-finals. Other players except the skipper were pretty average throughout the tournament. An interesting fact comes up when it was found that the captain has scored 55% of the runs Sri Lankan team scored in the World T20 championship. The other 10 players in the team were responsible for only the other 45% of the runs which was one of the major reasons for their early exit from the tournament.\n\nComing into the tournament, Lankans had never qualified for the quarter-finals and had never defeated Australia or New Zealand and have ensured that it remains the same this season, a record they won't be proud of. The middle order of Perera and Karunaratne again disappointed throughout the group stage as and when the middle order for exposed. The opening partnership never actually got going because of which the pairs were being continuously changed with different pairs being tried out with Chamari. With a change in a partner comes a change in sync, calling, etc. which somehow affected the overall gameplay of the team as a whole.\n\nThe only middle-order batsman who tried to stay in the middle in most of the matches was Anushka Sanjeewani who played a minimum of 15 deliveries in each match but later went on to give away her wicket easily without much hassle to the opposition teams.  The bowling department failed miserably and they could not at more than 5 wickets in any match. The batting was in shatters except for the skipper who played her part in every match owing to which Lankans couldn't manage a score greater than 120 in any match.\n\nIn 2017, during the women's 50 over world cup Chamari scored one of the absolute gems of an inning of all time where she scored an amazing 178 not outscoring a whopping 69% of Lanka's runs as a team and brought Lanka back into the game after they were lagging terribly at 130-6. The second-highest total after her was just a mere 24. Another instance where her team was not behind her when she needed them the most.\n\nSri Lankan went on to score 257 in her 50 overs but owing to poor bowling they lost the match as Australia chased the total successfully and pretty quickly.\n\nShe has been there for the Lankan team on the first cry. In the recent t20 again against Australia she scored her maiden T20 century scoring a quickfire 113 off just 66 balls and made the headlines yet again in North Australia. Lanka lost the game yet again owing to the same old problems of just one person standing without any support. To keep the hopes high, Chamari tweeted after the match \"Play freely, positive, courage. That's the three words I will say to my team.\" All this proves how good she is as a captain constantly striving towards betterment and keeping the team's morale up at all junctures of time.\n\nChamari averages amazingly against formidable sides like Australia, New Zealand, etc and always makes sure she's on the song from ball one. She keeps the scoreboard ticking with continuous running between the wickets and hitting boundaries in between to ensure the audience gets there share of entertainment. She is an amazing playmaker at the same time, a living legend and a motivational personality for  Sri Lankan cricket in years to come. If more players decide to walk on her path and methods Lankan cricket is surely gonna boom leaps and bounds in the future and this will be a dawn of a new generation in their Cricketing future.\n\nWhat sets apart Chamari Athapaththu from other players is her belief in herself. She has got the right attitude. When you will look at her on the field, you will find she is a leader by birth. As of recent, she has started bowling more overs too and she has picked wickets in the World t20 cup.\n\nHer stroke-making, the patience to play long and the zeal to win matches for her country are right up there, a little support from her teammates can do wonders for the Srilankan team.\n\nAll of this proves how complete a player Chamari Athapaththu is. She is a match-winner on her day, a handy bowler and an even better captain.\n\nThe only thing she would have hoped was a better companion at the nonstriker end who could have maintained her composure supporting her throughout her innings. Lanka lacked partnerships throughout the tournament which led to their eventual loss but the skipper proved her worth time and again leading from the front.\n\nStay tuned for more.","truncated_text":"The Sri Lankan Cricket team has seen a massive decline in recent years in both men/women categories in all aspects of the game. ","is_published":true,"created_on":"2020-03-08T00:00:00Z","image":"chamari.jpg","slug":"chamari-atapatuu-the-lone-warrior","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":11},{"id":58,"title":"Rain -  The opponent you cant fight against.","extended_text":"\"Rain rain go away, come again another day\" a nursery rhyme which is quite relatable in this generation of cricketing aspect. In recent times, the rain has been playing spoilsport in quite a few numbers of matches, leading to, unfortunately, results and controversial defeats of teams then on the verge of victory.\n\n Out of all the ICC rules, the one concerning rain is  DLS ie. The Duckworth Lewis Stern method is the most controversial and debatable at this hour. We have seen big teams go down to this unbeatable opponent: RAIN.\n\nThe first incidence that soon became the headline happened in 1992 where the South African team found themselves on the wrong side of the line.\n\nDuring the '92 Worldcup,  South Africa chasing a target of 253 in the stipulated 45 overs, started amazingly in the innings and were cruising towards victory at 231-6 in 42.3 overs. They finally needed just 22 off the 13 deliveries remaining when it rained again. The mathematical method kicked in and the calculations were performed.\n\nSuddenly out of nowhere the big screen at the SCG displayed a view that shocked the entire globe at a go. It displayed the revised total for South Africa which was a whopping 22 off just a single delivery. South African team was in tears as they had been rendered helpless in the match. This was not just a match, it was the Semi-final of the '92 cricket world cup and South Africa had made yet another failed attempt to qualify for the Worldcup finals keeping up to their tag of \"Chokers\". It was after this incidence that the method of DLS kicked into the cricketing circle after the horrors of the night.\n\nThe most recent cases include yesterday's Women's World Cup semi-final between India and England where the match was crucial and these stakes were high. In had been raining all day long on the previous day in Sydney who lived up to its reputation of having rain disasters and the matchday was once again washed out.\n\nAgain a Worldcup semi-final, one of whose participants were England once again but this time at the receiving end. Since there was no reserve day for the semi-final the winner of the rain-hit match was decided by who finished higher in the league standings. On account of that, the Indian women's cricket team made it to the final of the tournament for the first time in their cricketing history. Although the result was in India's end, the Indian fans along with the others around the globe weren't satisfied by such a qualification method to a world cup final.\n\nBack in 2008 during the India England series, the first innings were barred by incessant rains twice and the overs were reduced to 22 for India to bat. India scored 166 in 22 overs when the rain kicked in again and the D/L method kicked in where the target got increased to 198 in 22 overs. England could manage just 178 in their quota of 22 overs and lost a rather easy match by 19 runs. During the 2011 India South Africa ODI South Africa batting first had to leave the field twice on account of rain which ultimately reduced the number of overs to 46 in which they scored 250-9. But DLS kicked in and the score got increased to 268. This was the target that was revised as per what South Africa had scored if they would have known they had only 46 overs to bat from ball one. India was the one on the receiving end who couldn't keep up with the revised total and lost the match by 33 runs.\n\nDuring the final of Champions trophy 2013, between India and England, India went in to bat first at the legendary Lords stadium but the rain-hit match started 3 hours post the stipulated time and the ODI match had now become a 20-20 affair. India batted without much intent shown by anybody except Virat Kohli due to whose efforts India reached a modest 129 at the end of 20 overs. England was in high spirits at chasing this total in front of their home crowd appeared like a cakewalk but it wasn't. Ishant Sharma's heroics in this rain-hit match ensured India defeats England by 5 runs and handed India their first Champions trophy under the captaincy of MS Dhoni.\n\nAnother England India tie in 2011 had multiple stops during the match on account of rains. At one point in England chase, they were behind India's DLS par score. At the second stoppage they were ahead of India's DLS score but the umpires decision to keep the match in continuation removed it out of the equation. Later when the rain arrived once again the match was stopped again but this time England's score was exactly equal to the DLS total resulting in the match to end in a tie. This shows how important is the decision of an umpire in a rain-hit match as to when the game is stopped and how many overs are to be deducted. There was a margin of 7 deliveries which separated England from a victory as the match ended in a draw.  \n\nAll of these can be concluded by adding that rain has always played an important role in setting up the match result. It is a highly improbable aspect of nature and is unforeseen during the match gameplay. Although we have systems for forecasting rains but the end resort to this problem is DLS which is a rather controversial method of score prediction. Cricket needs a better remedy here either by having stadiums with closeable dome during monsoon or maybe a better score prediction method to standardize this method of score prediction and make the game fairer inch by inch.\n\nStay tuned for more.","truncated_text":"\"Rain rain go away, come again another day\" a nursery rhyme which is quite relatable in this generation of cricketing aspect.","is_published":true,"created_on":"2020-03-13T00:00:00Z","image":"rain.jpg","slug":"rain-the-opponent-you-cant-fight-against","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":9},{"id":54,"title":"Dhoni vs COVID-19","extended_text":"The moment your eyes gazed on the headline here, you would have been, to say the least, blown away by what is written. Dhoni vs Coronavirus, are you kidding me? To all Dhoni fans, it first comes as that their favorite player is fighting against the deadly COVID-19, well that is a metaphor and Dhoni is all fit and healthy and this is not to be meant literally, but as we said it's a metaphor, so there is some meaning to it.\n\nAfter the World cup 2019, in particular, after falling a few inches short of the crease in World cup semifinal and regretting about not diving, Dhoni is doing all sorts of things but cricket.\n\nThe former World cup winning captain has not played any cricket after the heartbreaking knockout, yet another knock out from an ICC event of the Indian team.\n\nFans want to know what their favorite player has been thinking. Has he retired or he will play only IPL or he will return to international cricket post IPL?\n\nThe first reason doesn't make sense as Dhoni has not retired but the other two options can represent the mental state of Dhoni to some extent.\n\nSince now Dhoni is back in Chennai, practicing and sweating it out on the field, the veteran is not going anywhere, he is still not done with cricket.\n\nThis answers a lot of questions on Dhoni's future but one question remains unanswered is What about international cricket? Will Dhoni make himself available for World cup t20 selection?\n\nSince Dhoni has not retired and will be playing IPL if it happens, he will certainly make himself available for selection. Things are smooth up to now.\n\nBut there has been one thing which is stopping Dhoni smooth entry into blue jersey again, and that is COVID-19, the Coronavirus.\n\nThe coronavirus which originated from China has declared his entry in India and the number of cases is increasing every day. The Airborne disease is a massive threat to humanity and humans still have not found any vaccine or cure against it, so they are doing what they can do best, and that is prevention.\n\nTo wash hands properly, take care of hygiene and most importantly avoid traveling, public gathering. The last pose a direct threat to the conduct of IPL 2020.\n\nA plea has already been filed in Madras high court to cancel IPL matches amidst the Coronavirus. The massive gathering of people in the stadium is the perfect setting a coronavirus can ask for to outbreak, posing a direct threat to IPL, and the BCCI is in some pressure to cancel the tournament because of the novel, not noble coronavirus.\n\nThe prize money has already been reduced to half and now the threat of empty stadiums because of coronavirus, is a problem to which BCCI has no answer. They are against a natural calamity and they are helpless. But what it has to do with Dhoni?\n\nDhoni has not played any cricket after the world cup 2019. It seemed like he was thinking to make a comeback in the national colors based on his performance in IPL.\n\nIndian head coach Ravi Shastri previously in a candid interview had also answered few questions on being asked about Dhoni's future.\n\nThe Indian head coach kept things simple. \"If he performs well in IPL and his fitness is good then he might be considered again\" suggesting Dhoni will not get open the door, enter into dressing room situation to get back into the Indian side.\n\nBut how Dhoni will make a case if the whole IPL gets canceled because of the coronavirus.\n\nThe states are evaluating the situation and since we have already seen the increased number of cases in India with new cases coming from Laddakh, Jaipur, Delhi, and Kerala and possibly the first casualty of a 76-year-old person in Karnataka, the fear that IPL may get cancel is getting more concrete as day are passing and that's not something Dhoni planned for.\n\nIf IPL does get cancel, Dhoni will have to sweat it out playing domestic tournaments to stand any chance of being part of the World cup squad.\n\nThough it's very unlikely that if Dhoni makes himself available for World t20 in Australia in later part of the year, he is not included on account of he has not played any competitive cricket, but the chances that it may happen are not zero.\n\nWith the new selection committee in place now with Sunil Joshi as chief selector, we as fans cant formulate any reasoning to find out what will happen in such a case.\n\nFor now, the novel coronavirus is standing firm against Dhoni's chances of getting back into the Indian team. If the IPL does get canceled, Dhoni will have to go back to from where he started and have to build up his case from ground zero.\n\nThe competitiveness in the domestic circuit in Indian cricket has increased so it will also be not a cakewalk for Mahi. This sudden natural calamity is working against M S Dhoni plans and he has no options but to go through it if that happens.\n\nAs of now at the time fo writing this article, IPL is about to begin as planned but with a plea in Madras high court and a letter to Central government to cancel IPL and unwillingness to host any matches of IPL in Karnataka by the state government, Dhoni will have to find some other way to get back into the Indian dressing room if all this leads to cancellation of IPL.\n\nStay tuned.","truncated_text":"The moment your eyes gazed on the headline here, you would have been, to say the least, blown away by what is written. Dhoni vs Coronavirus, are you kidding me?","is_published":true,"created_on":"2020-03-13T00:00:00Z","image":"Dhoni.jpg","slug":"dhoni-vs-covid-19","author":{"id":0,"name":"Tarun Prakash Singh","name_key":"tps","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":9},{"id":23,"title":"Bangladesh registered their first T20 win against India in Kotla","extended_text":"Some eye opening for Indian team as they were defeated for the first time in T20 internationals by Bangladesh breaking the streaks of 8 wins.The very talk of the town India playing T20 games with ODI mindset got more head behind it as there was no intent from Indian team in the first 17 overs.Only player who played well was Shreyas Iyer and if not for some good hitting from Washington Sunder and six of the last ball the score would have been much less.\n\nIndia managed to put 148 runs in 20 overs and it was a good total in the end. The intent from Bangladesh was right up there from the very first ball in batting and though they lost Litton Das in the very first over, they kept looking for runs.Debutant Naim played well ,he looked in trouble against Yajuvendra Chahal who was making his comeback and bowled beautifully.\n\nMushfiqur Rahim rode his luck well and smashed 4 consecutive boundaries of penultimate over of Khaleel to leave just 4 of the last over.Some silly cricket from Indian team by not going for DRS when Rahim was struck straight but Yajuvendra Chahal should have asked Rohit Sharma to take the review.A drop catch by Krunal Pandya added to further woes for India. Mehmudullah finished things off with a six who also played beautiful lofted cover drive of Yajuvendra Chahal which was short of the match.\n\nThe series is wide open now and both teams eyeing on the 2nd T20,Bangladesh to wrap up the series and India to keep the series alive.\n\nStay tuned.","truncated_text":"Some eye opening for Indian team as they were defeated for the first time in T20 internationals by Bangladesh breaking the streaks of 8 wins.The very talk of the town India playing T20 games with ODI mindset got more head behind it as there was no intent from Indian team in the first 17 overs.Only player who played well was Shreyas Iyer and if not for some good hitting from Washington Sunder and six of the last ball the score would have been much less.","is_published":true,"created_on":"2019-11-04T00:00:00Z","image":"Bangladesh-win_04-11-19.jpg","slug":"bangladesh-registered-their-first-t20-win-against-india-in-kotla","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":2},{"id":35,"title":"Innings win for Australia, centuries for Taylor-Williamson","extended_text":"Pakistan in their second test match has been defeated by Australia by an innings and 48 runs.\nPakistan in their second innings following to the first innings score of 589 of Australia, managed only 239 runs.\nShan Mashood and Asad Shafiq spent defended for some time in the middle, both crossing 50 run mark, but none of the other batsman showed any will to stay at the crease any longer.\n\nNathan Lyon who was seeing things from far till now, as the pace battery of Starc, Hazlewood, and Cummings was on a roll, took things in his hand and sent 5 Pakistan batsman to pavilion. This is sheer dominance from the Australian team and Pakistan team is going nowhere with these kinds of performances.\n\nThe other test between England and New Zealand resulted in a draw.\n\nBatting first New Zealand scored 375 runs with the help of Tom Lathams hundred who didn't have a good show at the world cup 2019. He was helped by B J Watling half-century, carrying on from his superb knock of double hundred.\n\nEngland in their first innings made 476 runs. Joe root after a long time scored a century and went on to pass the 200 run mark as well.The unconventional opening batsman for England Rory Burns also had a century to his name before he was run out.\n\nNew Zealand saw 2 centuries in their second innings as their Mr Consistent, no. 3 and 4 in the limited-overs format, Williamson and Taylor had a good partnership and both added a count to their stats as well. If not for the 84 overs of play affected by rain, the fans could have witnessed a winner at the end of the test match, which finally ended in a draw.\n\nStay tuned.","truncated_text":"Pakistan in their second test match has been defeated by Australia by an innings and 48 runs.\nPakistan in their second innings following to the first innings score of 589 of Australia, managed only 239 runs.","is_published":true,"created_on":"2019-12-03T00:00:00Z","image":"Williamson_03-12-19.jpg","slug":"innings-win-for-australia-centuries-for-taylor-williamson","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":2},{"id":39,"title":"Rahkeem Cornwall dismantles Afghanistan with his off breaks","extended_text":"Rahkeem Cornwall, the WestIndies offspinner who was in the news on debut for all the wrong reasons with everyone talking about his weight, which is yes slightly above the ideal weight for sports, is creating problems for the Afghanistan batsman in the ongoing test in India.\n\nThe big fella who comes up with an orthodox action has already picked up 10 wickets in the test match.\n\nAfter picking up 7 wickets in the first innings, Cornwall continued to test Afghanistan batsman with his off-breaks in the second innings and has already picked up 3 wickets.\n\nBisecting the action of Rahkeem Cornwall, he doesn't have the momentum coming into the bowling crease. He doesn't run fast like Afghanistan mystery spinner Mujeeb Ur Rehman. He also doesn't have the fast revolutions behind the ball like Graeme Swan, but what he has is a push at the time of delivering ball which enables him to get the bounce and thanks to his height he is able to pitch the ball at dangerous spots regularly.\n\nThis is what makes him. Bounce and consistency to bowl at a particular length, so if the pitch offers something, he is straight into the business from ball 1.\n\nIn tests against India also he didn't go for too many runs and was economical because the ball keeps rising on you and it becomes difficult to drive or cut it away. Especially to cut the ball, as the ball was already on a good height by the time it reaches stumps and this makes the batsman play the ball in the air.\n\nAfghanistan is now leading by 21 runs and they have only 2 wickets to extend their lead. Rahkeem Cornwall already has taken 3 wickets and he will not mind picking the rest 2 to have his another 5 wicket hall of the match.\n\nStay tuned.","truncated_text":"Rahkeem Cornwall, the WestIndies offspinner who was in the news on debut for all the wrong reasons with everyone talking about his weight, which is yes slightly above the ideal weight for sports, is creating problems for the Afghanistan batsman in the ongoing test in India.","is_published":true,"created_on":"2019-11-29T00:00:00Z","image":"Cornwall_29-11-19.jpg","slug":"rahkeem-cornwall-dismantles-afghanistan-with-his-off-breaks","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":3},{"id":28,"title":"India set to play their first day night test,Nicholas Pooran suspended","extended_text":"After a convincing series win against Bangladesh,India is setting eye on their first day night test in Kolkata against Bangladesh starting November 14.Bangaladesh started the India tour on high, but lost their path afterwards, the key element lacking in them to carry on from a good start.\n\nMahmudullah captaincy though was impressive and few of their debutant performed really well.The stand out was the performance of Naim who played blizzering innings of 81 runs in the final T20.Spin department was good for Bangladesh but time is running out for Mustafizur Rehman who has been given  prolonged run despite his bad form with the ball.\n\nIndia found positives in the name of Shreyas Iyer.Deepak Chahar was exceptional in the final T20 and Shivam Dube has done enough to be part of the mix in upcoming T20 series.Not to forget the exceptional performance of Yajuvendra Chahal who was making his comeback in the T20 team.\n\nThis will be the first day night test for India and Ajinkya Rahane has already stated that the key will be to negate the lateral movement by playing the ball late.It’s not the Bangladesh strongest format but they certainly have played good cricket so far and will come on the field with positive intent.\n\nIn other news, Nicholas Pooran has been suspended for altering the condition of the ball.Pooran is seen as an important player for West Indies team but he needs to remember Cricket is a gentleman's game and these things will certainly not help his career as a professional cricketer.\n\nVirat Kohli, who is back to training and will lead India in Kolkata for the day night test showed his support on Maxwell, saying mental fatigue and illness should not be seen as taboo. Cricketers have to deal with a lot of pressure all the time and if some player feels he needs some time off the field, that decision should be respected among cricket community.\n\n For chess fans who don't mind seeing some cricketing faces along, Vishwanath Ananad will ring the bell in Eden Gardens,Kolkata.\n\nStay tuned.","truncated_text":"After a convincing series win against Bangladesh,India is setting eye on their first day night test in Kolkata against Bangladesh starting November 14.Bangaladesh started the India tour on high, but lost their path afterwards, the key element lacking in them to carry on from a good start.","is_published":true,"created_on":"2019-11-13T00:00:00Z","image":"test-Ball-13-11-19.jpg","slug":"india-set-to-play-their-first-day-night-test-nicholas-pooran-suspended","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":3},{"id":37,"title":"David Warner denied the chance to score 400, Yasir Shah scores a century","extended_text":"David Warner who didn't have a great time in the middle with the bat against England in Ashes is back in his true colors.\n\nThe left-handed opener for Australia was on a roll against Pakistan in the second test match. He remains not out on 335 at a strike rate of 80, before Tim Paine felt the team has got enough runs on the board, declaring on 589/3.\n\nThere was 42 overs of play still left on day 2 at the time of declaration. Well, there was no certainty whether David Warner could have made 400 and beat another left-handed, the stylish Brian Lara record of the same,  but he had the best of chances to cross 400 and another 15-20 overs of play could have allowed him to write his name in record books.\n\nNot every day, you will find a batsman batting on 335 and there's still 42 overs of play to be played.\n\nDavid Warner got good support from the last match centurian and Australia new number 3, Marcus Labuschagne who played well-constructed innings of 162 runs.\n\nPakistan in reply took the same course as they did in their first match. They were 95/6 at the end of second days play and it looked like Australia will finish the test Match on day 3 itself, but Babar Azam and Yasir Shah tried to fight it off for their team.\n\nThe partnership was much needed for Pakistan and their best batsman and their leggie Yasir Shah played well to at least save Pakistan from the embarrassment.\n\nBabar Azam scored 97 runs and missed out on a well deserved century, his partner though stayed longer to get to his first maiden century. In the end, Pakistan got out for 302 runs with Yasir Shah as their top scorer with 113 runs.\n\nAustralia enforced the follow on and the second innings followed the same story for Pakistan so far. Their top 3 batsmen are already in the pavilion and they also don't have Babar Azam this time, as he was caught behind by Hazlewood.\n\nStarc is a leading Australian bowling attack. He picked up 6 in the first innings. Hazlewood and Pat Cummins also chipped in with some wickets.\n\nThis is by far the weakest bowling display from Pakistan in Australia. Their bowlers are just not up to the mark and simply can't create enough pressure to force the Australian batsman to give them some chances in the field.\n\nTheir batting is also the same story except for Babar Azam and Yasir Shah in this match. This is not the quality of cricket that the world is used to see from Pakistan. They need to fix things and come up with a fighting spirit and should give their fans moments to celebrate.\n\nStay tuned.","truncated_text":"David Warner who didn't have a great time in the middle with the bat against England in Ashes is back in his true colors.","is_published":true,"created_on":"2019-12-01T00:00:00Z","image":"warner and yasir_01-12-19.png","slug":"david-warner-denied-the-chance-to-score-400-yasir-shah-scores-a-century","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":4},{"id":53,"title":"Men in Blue seal 5-0 series win against Black Caps in final T20I","extended_text":"How many times we have seen teams so near to clean sweep the series but the tiger in the losing team fights hard in the last contests to provide their fans with some moments to cheer about, but that's not the case with Indian team who has clean swept New Zealand 5-0 in the T20 series.\n\nThe last two matches went to super over but New Zealand has only themselves to blame as they couldn't react better to pressure situations.\n\nIn the last two matches, even that was not required and any batsman with average skills and calm head on his shoulders would have taken them home.\n\nBut New Zealand at the moment is in complete disarray as they are just not finding a way to get over the line.\n\nThey have fought back in the matches, and there were moments when it looked like they are in there for an easy finish but somehow, somewhere India found a way to get back into the game. We can either appreciate the brilliance of Indian bowlers or we can blame New Zealand batsman for playing poor cricket especially in the last 5 overs. The latter seems more reasonable in contrast to what happened in the last three matches.\n\nIndia in the 5th T20 had an average performance with the bat and they put 163 runs on the board.\n\nNew Zealand was shaken early by three quick wickets but Tim Seifert and Ross Taylor played well to bring the game to almost run per over.\n\nBut if we can't guarantee other things but we are sure that India is not going to let things slip easily.\n\nWith what looked like a cakewalk for kiwis with a run per ball, a couple of quick wickets dragged them to the back seat.\n\nIndian bowlers, especially Bumrah and Saini kept things tight and despite the two sixes of Thakur in the last over, Newzealand fell short by 7 runs, handling India a series win of 5-0.\n\nA lot of philosophical talk in the post-match presentation by Kohli and K L Rahul looked all pleased with his Man of the series. He is in some form at the moment and he will like to carry his crisp hitting in the coming World cup.\n\nIndia couldn't have asked for a better start, in fact, this is the best they could have and focus is now to keep things on the same line in the ODI series.\n\nTill then, stay tuned.","truncated_text":"How many times we have seen teams so near to clean sweep the series but the tiger in the losing team fights hard in the last contests to provide their fans with some moments to cheer about, but that's not the case with Indian team who has clean swept New Zealand 5-0 in the T20 series.","is_published":true,"created_on":"2020-02-02T00:00:00Z","image":"indvsnzt20_02-02-2020.jpg","slug":"men-in-blue-seal-5-0-series-win-against-black-caps-in-final-t20i","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":4}]}