[{"id":12,"title":"Rohit Sharma slams third hundred of the series","extended_text":"Not so before Rohit Sharma got the opportunity to open the innings in the longest format of the game and the decision which came bit late for his fans, he is showing all, he is equally capable to play long innings in test matches.\nIts his 3rd hundred in 4 innings he has played so far in the series. The play was interrupted due to bad light, India recovering from early blows at 224/3.\nAjinkya Rahane is also looking good for hundred and good chance for Rohit Sharma to make this hundred a daddy hundred or a double century. India will be looking to play while day tomorrow and test South African openers for the last 10 overs.Stay tuned.","truncated_text":"Not so before Rohit Sharma got the opportunity to open the innings in the longest format of the game and the decision which came bit late for his fans, he is showing all, he is equally capable to play long innings in test matches.","is_published":true,"created_on":"2019-10-19T00:00:00Z","image":"rohit-sharma_19-10-19.jpeg","slug":"rohit-sharma-slams-third-hundred-of-the-series","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":1},{"id":15,"title":"India wrap up the series 3-0,Rohit Sharma Man of the series","extended_text":"India cleansweeped Proteas as the fortunes not turning for the South Africa.After a poor world cup performance clean sweep of test series by India certainly not a good sign to where their team is going.They need to rethink,reevaluate and come out with new players, who can sustain the pressure and stop this downfall of their team atleast for their fans all around the world.\n\nNadeem wrapping up the remaining two wickets in no time. Rohit Sharma as expected won the Man of the series award saying he follows a certain template to his batting that has given him some success.\n\n3 hundred in 4 innings for him and 1 big double hundred for Virat Kohli.Mayank Agarwal also got a double hundred and Ajinkya Rahane also got hundred on home soil after 2016.Much needed for him.\n\nBowlers have been good.Shami classical in second innings,Ashwin in the first two test matches and Jadeja certainly has up his game in batting department which is giving the team India liability to play with 5 proper bowlers.\n\nNothing much to talk about from South Africa as they have been in complete disarray in all departments.Dean Algar started the series on high but lost his way through in the last two matches and the spin bowling has been very poor for them.\n\nLion in his den was spotted as Mahendra Singh Dhoni came to the dressing room and had a chit chat with his teammates.No news on his availability for the coming Bangladesh series though.\n\nIndia certainly will like to carry this good form and with no big tournament win for team India in the recent years ,the focus will be on world cup T20.\n\nStay tuned for further updates","truncated_text":"India cleansweeped Proteas as the fortunes not turning for the South Africa.After a poor world cup performance clean sweep of test series by India certainly not a good sign to where their team is going.They need to rethink,reevaluate and come out with new players, who can sustain the pressure and stop this downfall of their team atleast for their fans all around the world.","is_published":true,"created_on":"2019-10-22T00:00:00Z","image":"india-win_22-10-19.jpg","slug":"india-wrap-up-the-series-3-0-rohit-sharma-man-of-the-series","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":2},{"id":29,"title":"What's going on Dhoni's mind?","extended_text":"Mahendra Singh Dhoni is not seen on the cricketing field after world cup.The World Cup winning captain for team India has taken time off from the cricket field to spend some time with military forces and then further was not available for selection against Bangladesh series.There have been speculations and all sorts of talk going around on what he is really upto.Has he retired in his mind and is just to make formal announcement any time or he is thinking something else.What really is going on Dhoni's mind?\n\nDhoni has not played any cricket from few months but he has not retired too.So he is not done yet as far as international career is concerned.He is thinking to play selective cricket from here.He is eyeing the big tournaments.He is still fit at 38 and with two  world T20 cup one after the other, he will certainly make himself available for the selection.\n\nEverybody knows the impact he makes when he is on the field.He showed world once again that he is made of nerves of steel in world cup semifinal.And if not for a slight hesitation in coming back for that second run, he would have taken India home.\n\nNo surprises even if he will make himself available for next ODI world cup.He knows he will not be an automatic selection in the playing 11,but he will  not be affected by this.What he will do with this approach of him is to give team management the cushion to play him as a batsman or wicket keeper batsman in crucial games. Time is running out for Rishabh Pant and Sanju Samson will be given chances to show what he is capable of but Dhoni has nothing to do with things going around him.He is thinking like a player who works hard and his only dream is to represent India at the international level.\n\nHe knows he  can't play all series but he is there for big tournaments.Whether the team thinks he can make a difference in the playing 11 or not is another thing but he will make himself available for big tournaments.A good approach from him .Not like some great players retiring just after one  bad series. He came as a player and he will go as a player.\n\nStay tuned.","truncated_text":"Mahendra Singh Dhoni is not seen on the cricketing field after world cup.The World Cup winning captain for team India has taken time off from the cricket field to spend some time with military forces and then further was not available for selection against Bangladesh series.There have been speculations and all sorts of talk going around on what he is really upto.Has he retired in his mind and is just to make formal announcement any time or he is thinking something else.What really is going on Dhoni's mind?","is_published":true,"created_on":"2019-11-14T00:00:00Z","image":"MS-Dhoni-14-11-19.jpeg","slug":"whats-going-on-dhonis-mind","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":3},{"id":13,"title":"Rohit double hundred,India in charge","extended_text":"Rohit Sharma slammed first double century of his test career as South African bowlers led frustrated by the counter attack of Rohit Sharma and Ajinkya Rahane.Rahane also played magnificently scoring a hundred.\n\nIndia declared on mammoth total of 497 runs and also managed to pick 2 South African wickets as the visitor scorecard reads 9 at the loss of 2 wickets.\nSouth Africa really need to show his A game from here if they want to avoid a clean sweep of the series while Virat Kohli knows it's their best chance to clean sweep the series at home.\n\nExpecting a fight from South African batsman and looking forward to how the local boy Shadab Nadeem will bowl.\nStay tuned.","truncated_text":"Rohit Sharma slammed first double century of his test career as South African bowlers led frustrated by the counter attack of Rohit Sharma and Ajinkya Rahane.Rahane also played magnificently scoring a hundred.","is_published":true,"created_on":"2019-10-20T00:00:00Z","image":"india_rohit_20-10-19.jpg","slug":"rohit-double-hundred-india-in-charge","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":1},{"id":17,"title":"We are moving on from MS Dhoni: MSK Prasad","extended_text":"Team for T20 and tests against Bangladesh on home soil  have been announced .Virat Kohli has been rested for T20s and Rohit Sharma will lead the team India .Sanju Samson and Shivam Dube have been given maiden call ups  after their brilliant show in Vijay Hajare trophy. With Sanju Samson coming into the team and Rishabh Pant not living upto the hype ,a great opportunity for the Kerala boy to present his case for the wicketkeeper batsman for India.\n\nMSK Prasad has told clearly that they are now looking ahead of Dhoni ,and Dhoni and selectors are on the same page with this. Though there was no clarity about whether Dhoni himself made unavailable for the T20 or selectors overlooked him .Looks like Dhoni will make himself available for the world cup T20 and he wants to play selective cricket from here.No surprises even if he makes himself available for world cup 2023. Seems like, Dhoni is thinking like a young batsman and still thinks he has cricket left in him which will help India in big tournaments,and we have no doubts about Dhoni match winning capabilities.","truncated_text":"Team for T20 and tests against Bangladesh on home soil  have been announced .Virat Kohli has been rested for T20s and Rohit Sharma will lead the team India .Sanju Samson and Shivam Dube have been given maiden call ups  after their brilliant show in Vijay Hajare trophy. With Sanju Samson coming into the team and Rishabh Pant not living upto the hype ,a great opportunity for the Kerala boy to present his case for the wicketkeeper batsman for India.","is_published":true,"created_on":"2019-10-25T00:00:00Z","image":"Samson_25-10-19.jpg","slug":"we-are-moving-on-from-ms-dhoni-msk-prasad","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":1},{"id":18,"title":"Warner 100 in 1st T20 against Sri Lanka","extended_text":"Some relief for David Warner as he scored blizzering century of 56 balls which included 4 sixes to help Australia put a mammoth total of 232 in 20 overs.In reply Sri Lanka was completely undone by Australian bowlers as they managed to score a mere 99 runs in 20 overs for the loss of 9 wickets.\n\nWarner who had dearth of runs in Ashes, had a lot to prove his place in the playing 11 and this hundred will certainly up his confidence to put his career back in place.\nMaxwell gave him good support from other hand with  62 runs in just 28 balls.\n\nSri Lanka will want to leave this loss behind and will look to put Australia under pressure in rest of the series.They will certainly want to continue from the clean sweep of 3-0 against Pakistan but this new face Sri Lankan team need to show consistency to match the level of brand of cricket Sri Lanka used to play before.\nStay tuned.","truncated_text":"Some relief for David Warner as he scored blizzering century of 56 balls which included 4 sixes to help Australia put a mammoth total of 232 in 20 overs.In reply Sri Lanka was completely undone by Australian bowlers as they managed to score a mere 99 runs in 20 overs for the loss of 9 wickets.","is_published":true,"created_on":"2019-10-28T00:00:00Z","image":"warner_28-10-19.jpg","slug":"warner-100-in-1st-t20-against-sri-lanka","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":1}]