{"articles":[{"id":32,"title":"What's ahead for Kuldeep Yadav?","extended_text":"Not long before, Kuldeep Yadav was a regular feature in the Indian cricket team for ODIs and T20s. The wrist-spinner along with Yajuvendra Chahal was having a dream run in the field, choking the flow of runs and taking crucial wickets in the middle overs, the key to winning in 50 overs cricket. But that just the first half of the story.\n\nBefore the world cup, everything was going good for the spin-duo also popularly known in the subcontinent as Kul-cha. But ever since the World Cup 2019, the team management has started to look at other options and they have their reasons for this hunting.\n\nYajuvendra Chahal had a great start to the world cup. He bowled superbly to pick 4 wickets against South Africa and if not for missed chances he would have taken a fifer. Kuldeep Yadav, on the other hand, was average at most. He was not able to restrict the scorecard and had a hard time picking wickets too.\n\nWhen India was set to play against New Zealand, and Ravindra Jadeja coming into the side in the later part of the tournament, it was obvious that India would be playing only one wrist spinner in the semifinal and the choice was obvious, Yajuvendra Chahal as he was the better of two wrist spinners.\n\nYajuvendra Chahal also went for 63 runs in the semi-final, but he picked the wicket of Kane Williamson, though he himself would rate his performance in world cup semifinal as below average.\n\nIf we rate Chahal’s performance in the world cup campaign starting on high and finished around average, Kuldeep Yadav’s graph only got down from match 1.\n\nAfter the world cup, there were only a few ODI matches in the plan for team India as all team want to play as many T20 as possible to prepare for the coming world cup T20 in 2020.\n\nIndian cricket coach put weight on letting go the strategy of playing two wrist spinners in the playing 11.The batting capabilities of both the wrist spinners just added more woes to them, as India shifted to spinners who know to hold bat too.\n\nAs a result, Yajuvendra Chahal and Kuldeep Yadav were not part of the mix in t20 and the team gave chances to new players.\n\nIn came Krunal Pandya, Rahul Chahar, Washington Sundar. But the new faces in the team didn't up the team performance by much.\n\nThe wicket-taking capability was missing from this new face Indian T20 setup who can bat up to 11, but only in papers. Also, some great batsmen didn't see India's approach to deepen the batting line up at the cost of wicket-taking bowlers.\n\nSelectors and team management noticed this, and realizing there's ample time left before the world cup begins, Yajuvendra Chahal was included against Bangladesh for home series.\n\nKuldeep Yadav was not recalled as he is out of the team due to shoulder injury.\n\nYajuvendra Chahal made a great comeback on his return as he bowled class apart. He was exceptional in all 3 t20s and he has given team India some relief ahead of the world cup.\n\nThis strong comeback from Yajuvendra Chahal and the untimely injury for Kuldeep Yadav has made things hard for Kanpur boy, as the Indian team certainly will not look to play 2 wrist spinners again in the same team for T20s.\n\nKrunal Pandya has performed good and Washington Sunder has improved his batting, making things further difficult for Kuldeep Yadav.\n\nIn the ODI side, it’s obvious now that Yajuvendra Chahal will be given preference over any other spinner as of now, leaving only the test format to fight for Kuldeep Yadav.\n\nRepresenting  Indian again in blue Jersey doesn't look easy for Kuldeep Yadav as of present. He performed well to be part of the team but his world cup performance was certainly below par, but he should think positive from here as he will be given his chances, and he should look to play every match as his last match.\n\nStay tuned.","truncated_text":"Not long before, Kuldeep Yadav was a regular feature in the Indian cricket team for ODIs and T20s. The wrist-spinner along with Yajuvendra Chahal was having a dream run in the field, choking the flow of runs and taking crucial wickets in the middle overs, the key to winning in 50 overs cricket. But that just the first half of the story.","is_published":true,"created_on":"2019-11-20T00:00:00Z","image":"kuldeep-yadav-20-11-19.jpg","slug":"whats-ahead-for-kuldeep-yadav","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":6},{"id":16,"title":"T20s and need of change in approach for Team India","extended_text":"The one format every cricketing nation wants to focus on now is the T20 format.Started not long before,the T20 format is the most watched format among cricketing fans.But looks like Indian team is not fully aware of the fact that all you got are 120 balls only. Team India have been playing T20 format like one day cricket by playing too defensive cricket and with World Cup 2020 around the corner ,it certainly calls for change of approach for Indian team.\n\nThe other team which has done quite well in this shortest format is England and one of the reasons is their long batting lineup and no hesitation or second thoughts in going bang bang from the very first ball.Even if some early wicket falls,they don't change their batting approach and plays attacking cricket while Indian team looks to pass few overs, taking over his mentality from the 50 over format.\n\nAnother example is the most successful team in T20 format having won the World Cup twice, is West Indies.They also goes hard to the bowlers from the starting of the innings.The next batsman in the crease knows nothing about what the wicket column reads, and he still looks to play attacking cricket.While some will disagree that there are some low scoring total in T20 too but with this attacking approach ,the chances of having a collapse is not substantial.\n\nYou just can't pass the ball back to the bowler. You will have to find some ways to keep the scoreboard ticking,this is not your 50 over format. 120 balls and 10 wickets is enough to not fool around hanging in there for nothing.\n\nIndian team seriously needs to address this issue if they fancy their chances of winning T20 World Cup.Indian team has done well in recent times but if we talk of major tournament wins the counter reads zero and this is what all matters.\n\nIndian team will be playing a lot of T20s to rehearse for the coming world cup and they should start playing with this new approach. Failing to do so ,a loss at a big tournament is waiting and fans are just not ready for it after the poor show of batting in world cup semifinal.","truncated_text":"The one format every cricketing nation wants to focus on now is the T20 format.Started not long before,the T20 format is the most watched format among cricketing fans.But looks like Indian team is not fully aware of the fact that all you got are 120 balls only. Team India have been playing T20 format like one day cricket by playing too defensive cricket and with World Cup 2020 around the corner ,it certainly calls for change of approach for Indian team.","is_published":true,"created_on":"2019-10-24T00:00:00Z","image":"T20-24-10-19.jpg","slug":"t20s-and-need-of-change-in-approach-for-team-india","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":3},{"id":21,"title":"Rahul Chahar vs Yajuvendra Chahal vs Kuldeep Yadav,who India should play in world T20?","extended_text":"World cup T20 is less than a year away.While it is majorly regarded as batsman game ,bowlers too get their day in low scoring games and any captain loves to have wrist spinners in their team ,as they pick up wickets at crucial times.After the defeat in world cup semifinal ,Yajuvendra Chahal and Kuldeep Yadav were not selected for T20 cricket citing the reason to have long batting line up,hence the focus shifted on the players who can hold on with the bat for some time in the middle.\n\nIndian team gave chance to Rahul Chahar for his impressive performance in IPL 2019,but he has got very few chances and in those very few chances he has got,he was not impressive at all going for runs.\nHe has good action ,straight run up,an orthodox action but he can turn the ball .At times it looks like he can be hit very easily by lining him up but he can pick up wickets too with same deliveries. He needs to find a balance between tight line and those flighted deliveries which can deceive batsman into playing a big shot.\n\nYajuvendra Chahal has been the backbone of Indian bowling line up for quite some time in the limited overs format.He has performed reasonably well in 50 overs and 20 overs cricket. Though he could have performed better against New Zealand in world cup semifinal where he was the alone wrist spinner for team India ,he went for 63 runs in 10 overs .He started the campaign on high by picking 4 wickets against South Africa but Indian team and Indian fans certainly wanted him to step up in the biggest tournament of cricket.While we can’t say he failed,his performance in the later part of the tournament was slightly below average but just slightly. Adds to this,his inability with the bat ,Indian management thought of trying bowlers who can bat a little ,the experiment which has failed miserably and Chahal has been recalled for the home T20 series against Bangladesh.This is good chance for him to prove his worth again and he certainly did nothing wrong which can keep him out of the team but he himself will certainly want to step up his game and help India winning more matches in big tournaments.\n\nNext,we have Kuldeep Yadav.India have played both Yajuvendra Chahal and Kuldeep Yadav in limited overs format for quite some time, but the world cup performance of Kuldeep Yadav has been below par.He was not able to pick up wickets ,also he didn't bowl tight lines and he was expensive in the world cup.Though the road to return is not completely closed for him,to make comeback in T20 international is an uphill task for him.On any given day ,Yajuvendra Chahal is a better bowler than him and he needs to come up with Kuldeep 2.0 if he fancies any chances of playing limited overs cricket again after his shoulder injury.\n\nThen we have Shreyas Gopal who resembles Kumble in bowling action .He can bat but the selectors at this time is not looking at him.The call for him in T20 cricket is certainly just around the corner and can come up at any time.Though he doesn't have the surprise element or a great action but he needs to be given some chances too.\n\nOther than these players, India doesn't seem to have backup options in spin bowling department.Rahul Chahar will be given games to prove his metal ,but he will see tough competition from Yuji Chahal.\n\nWho India will play for world T20 is how these players will perform in the coming series but as for now ,the wrist spinner position is for to take.\n\nStay tuned.","truncated_text":"World cup T20 is less than a year away.While it is majorly regarded as batsman game ,bowlers too get their day in low scoring games and any captain loves to have wrist spinners in their team ,as they pick up wickets at crucial times.After the defeat in world cup semifinal ,Yajuvendra Chahal and Kuldeep Yadav were not selected for T20 cricket citing the reason to have long batting line up,hence the focus shifted on the players who can hold on with the bat for some time in the middle.","is_published":true,"created_on":"2019-10-31T00:00:00Z","image":"Kuldeep-Yadav-Yuzvendra_31-10-19.jpg","slug":"rahul-chahar-vs-yajuvendra-chahal-vs-kuldeep-yadav-who-india-should-play-in-world-t20","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":6},{"id":24,"title":"Can ODI greats become T20 greats too?","extended_text":"There are 3 formats followed in cricket.Test cricket is played with red cherry and 50 overs and 20 overs follows white ball.There are number of batsmen who have played superb innings in one format but when we talk about the transition from one format to another,there are very few players who are successful in all 3 formats.\n\nGoing back into time,Rahul Dravid was a champion test player and one of the all time best players in the test cricket but he certainly didn't have the same success in ODI cricket. By no means he was bad or average in ODI,but if we compare his test cricket with ODI cricket he himself would have wanted more impactful innings in the 50 over format.\n\nThen there were players who were considered as best in one format and they hardly played a significant amount of matches in ODI format back then.Justin Langer is one such player who had tons of runs under his belt in red ball cricket but his ODI career is not worth mentioning.With time, those players focused on one format only and tried to become one format genius.\n\nFew players  transitioned from ODI format to test cricket too and the transition  went well for them.Virendra Sehwag is one such player who revolutionized test cricket by playing with the same aggressive mindset like in ODI cricket.\n\nThe close fielders and enough gaps in the field in test cricket helped him getting value for his shots and he became so good in test cricket that by the time he retired he had a test average of 45 with strike rate of above 80, making him one of the best test batsman India have ever produced.He finished ODI with average of 35,slightly below average considering his test match performance.In the end Sehwag can be considered as champion test batsman but an average ODI player although he started playing ODI cricket before.\n\nRohit Sharma is yet another batsman who is following the footsteps of Sehwag having won Man of the series in the recently concluded test series against South Africa, but the difference is Rohit Sharma is already champion limited format batsman, be it ODI cricket or T20 cricket, and he looks very determined this time to carry on his great stats of ODI cricket into test cricket too.\n\nComing to bowlers and on the contrary we have Shane Warne who is all time great test bowler but in limited overs format he has lesser number of wickets than Sri Lankan legend Sanath Jaysuriya. Not just wickets his economy was also on the higher side. The transition from test cricket to ODI cricket for Shane Warne did not conclude as he wanted.\n\nIndia also had one unsung hero in test cricket who didn't get chance to represent in ODI cricket.Any guesses? We are talking about Wasim Jaffer who used to hit daddy hundreds every time he passes the 100 run mark and was a little unfortunate to not play for a longer period of time.\n\nThen comes T20 cricket and we are now seeing pool of players wanting themselves to be tagged as T20 specialist.These are the players who promises to hit few into the stands when needed, and can bowl a few overs too along with livewire in the field. Chris Gayle is one such player if we eliminate the fielding capabilities.He can bowl too.Actually Chris Gayle has got a good action which uses his height well and he is under bowled, teams focus on his batting capabilities only.\n\nShahid Afridi from Pakistan is also among the best players of T20 cricket.He has good record in 50 overs too, thanks to his economic bowling in the later part of his career.But he certainly will not want anyone talking about his test career.\n\nSo,what exactly is needed to allow players to have smooth transformation from one format to another. One player, we actually have two of them with other needs a little  more effort in T20 cricket.The two greats of the modern era -  Virat Kohli and Steven Smith.Virat Kohli has been exceptional in all 3 formats.Though he didn't have a century to his name in T20 format, he gave  some match winning innings for team India.The best of him came against Australia in world T20 semi final when India needed something around 40 in 3 overs.\n\nThe reason he has been so successful across all formats is his technique and the way with which he builds the innings doesn't change.As he already said he looks to hang around there for first 20-30 balls and then take it from there.We can rate Steven Smith slightly higher than Virat Kohli in test cricket but just marginally, and the two are always in a race to who stands at 1st position in ICC rankings.T20 cricket is the area he will want to improve but he has given good performance against Pakistan in the ongoing T20 series and that's the quality of greats, they adapt faster. They make mistakes, but they learn quickly and become a better version of themselves.\n\nThe question is,should player focus on one format or they should look to excel in all formats.The key takeaway is to first get hold of ODI cricket. If you are doing good in ODI cricket, you can make certain changes in your games that will give you success in test cricket and T20 cricket too.The ODI format balances the aggression needed to keep the scoreboard ticking and stay there in the crease for a longer period of time.\n\nYes we forgot to talk about Joe Root but let's wait till he gave some top notch performances.\n\nStay tuned.","truncated_text":"There are 3 formats followed in cricket.Test cricket is played with red cherry and 50 overs and 20 overs follows white ball.There are number of batsmen who have played superb innings in one format but when we talk about the transition from one format to another,there are very few players who are successful in all 3 formats.","is_published":true,"created_on":"2019-11-07T00:00:00Z","image":"smith-07-11-19.jpg","slug":"can-odi-greats-become-t20-greats-too","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":9},{"id":29,"title":"What's going on Dhoni's mind?","extended_text":"Mahendra Singh Dhoni is not seen on the cricketing field after world cup.The World Cup winning captain for team India has taken time off from the cricket field to spend some time with military forces and then further was not available for selection against Bangladesh series.There have been speculations and all sorts of talk going around on what he is really upto.Has he retired in his mind and is just to make formal announcement any time or he is thinking something else.What really is going on Dhoni's mind?\n\nDhoni has not played any cricket from few months but he has not retired too.So he is not done yet as far as international career is concerned.He is thinking to play selective cricket from here.He is eyeing the big tournaments.He is still fit at 38 and with two  world T20 cup one after the other, he will certainly make himself available for the selection.\n\nEverybody knows the impact he makes when he is on the field.He showed world once again that he is made of nerves of steel in world cup semifinal.And if not for a slight hesitation in coming back for that second run, he would have taken India home.\n\nNo surprises even if he will make himself available for next ODI world cup.He knows he will not be an automatic selection in the playing 11,but he will  not be affected by this.What he will do with this approach of him is to give team management the cushion to play him as a batsman or wicket keeper batsman in crucial games. Time is running out for Rishabh Pant and Sanju Samson will be given chances to show what he is capable of but Dhoni has nothing to do with things going around him.He is thinking like a player who works hard and his only dream is to represent India at the international level.\n\nHe knows he  can't play all series but he is there for big tournaments.Whether the team thinks he can make a difference in the playing 11 or not is another thing but he will make himself available for big tournaments.A good approach from him .Not like some great players retiring just after one  bad series. He came as a player and he will go as a player.\n\nStay tuned.","truncated_text":"Mahendra Singh Dhoni is not seen on the cricketing field after world cup.The World Cup winning captain for team India has taken time off from the cricket field to spend some time with military forces and then further was not available for selection against Bangladesh series.There have been speculations and all sorts of talk going around on what he is really upto.Has he retired in his mind and is just to make formal announcement any time or he is thinking something else.What really is going on Dhoni's mind?","is_published":true,"created_on":"2019-11-14T00:00:00Z","image":"MS-Dhoni-14-11-19.jpeg","slug":"whats-going-on-dhonis-mind","author":{"id":0,"name":"Cricsurf","name_key":"Cric_admin","is_admin":true},"tag":[{"id":0,"name":"Trending","tag_key":"Trend","status":false}],"metadata":{"likes":0,"shares":0,"views":0,"comments":0,"page_title":"","meta_discription":""},"time_to_read":3}]}